* using python for gis things

#+property: header-args :noweb yes

** using [[https://pypi.python.org/pypi/Shapely][shapely]]

the [[toblerity.org/shapely/manual.html][manual]] looks promising.  shapely.wkt.loads(), shapely.wkt.dumps()
are what we need.

use ogrinfo to get wkt.  somehow slice it so it just includes the heat
perimeter.  then, read those into shapely:

#+BEGIN_SRC python :results output
from shapely import wkt

f1 = open("20160806_Soberanes_IR_heat_perimeter.wkt", "r")
f2 = open("20160807_Soberanes_IR_heat_perimeter.wkt", "r")

x1 = wkt.loads(f1.read())
x2 = wkt.loads(f2.read())

y2 = x2.difference(x1)
print y2
#+END_SRC

#+RESULTS:


then, export it somehow in kml format.

** using osgeo

[[https://pcjericks.github.io/py-gdalogr-cookbook/geometry.html][nice cookbook]]

#+BEGIN_SRC python :results output
from osgeo import ogr

wkt = open("20160806_Soberanes_IR_heat_perimeter.wkt", "r").read()
pgons = ogr.CreateGeometryFromWkt(wkt)

kml = pgons.ExportToKML()
print kml

#+END_SRC

#+RESULTS:


** total flow?

read kml in osgeo, export to wkt1, import wkt1 to shapely, do
differences, export difference to wkt2, read wkt2 in osgeo, export to
kml.

*** extract-geom

so, 1 utility that extracts Heat Perimeter from a kml file, producing
a kml-geom file (to stdout)

*** diff-geom

1 utility that takes two kml-geom files, subtracts the second from the
first, writes the result as a kml-geom file (to stdout)

then, standard gump to glue the resulting files together to produce
the difference file.

#+BEGIN_SRC python :results output
from shapely import wkt
from osgeo import ogr

f1 = open("20160806_Soberanes_IR_heat_perimeter.wkt", "r")
f2 = open("20160807_Soberanes_IR_heat_perimeter.wkt", "r")

pgons1 = ogr.CreateGeometryFromWkt(f1.read())
pgons2 = ogr.CreateGeometryFromWkt(f2.read())

kml = pgons1.ExportToKML()
print kml

#+END_SRC

#+RESULTS:
: None

this prints the wkt of a layer/feature of a kml file

#+name: extractwkt.py
#+BEGIN_SRC python :tangle extractwkt.py
  from __future__ import print_function # for eprint() below

  import argparse
  import os
  import osgeo
  from osgeo import gdal
  from osgeo import ogr
  import sys

  # XXX
  # it would be nice to read direct from a .kmz (zip) file.  but it
  # doesn't seem like the current gdal/ogr supports that.
  # import zipfile
  # zf = zipfile.ZipFile("20160729_Soberanes_IR.kmz", "r")
  # print(zf)
  # zf.namelist()
  # ndoc = zf.open("doc.kml")
  # data = doc.read()
  # XXX

  # get layer name: Soberanes
  # get feature name: Heat Perimeter

  # from [[http://stackoverflow.com/a/14981125][stack exchange]]
  def eprint(*args, **kwargs):
      print(*args, file=sys.stderr, **kwargs)

  def main(argv):
      cmd = argv[0]
      parser = argparse.ArgumentParser(description="extract the well-known text (wkt) of a feature of a layer in a file")
      parser.add_argument('-l', '--layername', type=str, required=True,
                          help="name of desired layer (in file)")
      parser.add_argument('-f', '--featurename', type=str, required=True,
                          help="name of desired feature (within layer)")
      # use "type=str" since we use the file name for ogr.Open()
      parser.add_argument('ifile', type=str,
                          help="file to process")
      args = parser.parse_args();

      # make sure ifile is readable
      if not os.access(args.ifile, os.R_OK):
          eprint("input file '%s' cannot be read" % args.ifile)
          sys.exit(2)

      # get polygons from this file
      pgons = procfile(args.ifile, args.layername, args.featurename)
      # print(pgons)
      wkt = pgons.ExportToWkt()
      print(wkt)

  def procfile(filename, layername, featurename):
      """extract the polygon of a given feature in a given layer in a given file"""
      file = ogr.Open(filename)
      # print("this is %s data" % file.GetDriver().GetName())
      # print("there is/are %d layer(s)" % file.GetLayerCount())
      l = file.GetLayerByName(layername) # type(l) == OGRLayerH
      if l is None:
          eprint("layer '%s' is not found in file '%s'" % (layername, filename))
          sys.exit(3)
      l.ResetReading()
      # find the right feature
      found = False
      for featid in range(l.GetFeatureCount()):
          feature = l.GetFeature(featid); # type(feature) == OGRFeatureH
          fieldid = feature.GetFieldIndex("Name");
          name = feature.GetFieldAsString(fieldid);
          if (name == featurename):
              found = True
              break;
      if not found:
          eprint("feature name '%s' not found in layer '%s' in file '%s'" %
                 (featurename, layername, filename))
          sys.exit(3)
      # okay, we found the right feature.  now, find the polygon, maybe
      # a multigeometry
      geometry = feature.GetGeometryRef().Clone()
      return geometry

  if __name__ == "__main__":
      main(sys.argv)
#+END_SRC

#+RESULTS:

#+name: differencewkt
#+BEGIN_SRC python :tangle differencewkt.py
  from __future__ import print_function # for eprint() below

  import argparse
  import os
  import osgeo
  from osgeo import gdal
  from osgeo import ogr
  import sys
  from shapely import wkt

  # XXX
  # it would be nice to read direct from a .kmz (zip) file.  but it
  # doesn't seem like the current gdal/ogr supports that.
  # import zipfile
  # zf = zipfile.ZipFile("20160729_Soberanes_IR.kmz", "r")
  # print(zf)
  # zf.namelist()
  # ndoc = zf.open("doc.kml")
  # data = doc.read()
  # XXX

  # get layer name: Soberanes
  # get feature name: Heat Perimeter

  # from [[http://stackoverflow.com/a/14981125][stack exchange]]
  def eprint(*args, **kwargs):
      print(*args, file=sys.stderr, **kwargs)

  def main(argv):
      cmd = argv[0]
      parser = argparse.ArgumentParser(description="compute the set-theoretic difference: fileA \\ fileB")
      # use "type=str" since we use the file name for ogr.Open()
      parser.add_argument('fileA', type=argparse.FileType('r'),
                          help="base set")
      parser.add_argument('fileB', type=argparse.FileType('r'),
                          help="set to remove")
      args = parser.parse_args();

      geo1 = wkt.loads(args.fileA.read())
      geo2 = wkt.loads(args.fileB.read())

      print(geo1.is_valid)
      print(geo2.is_valid)
      geo3 = geo1.difference(geo2);

  if __name__ == "__main__":
      main(sys.argv)
#+END_SRC

try to figure out what's going on

#+BEGIN_SRC python :results output
import shapely
import shapely.geometry

a = shapely.geometry.Point(1, 1).buffer(1.5)
b = shapely.geometry.Point(2,2).buffer(1.5)
c = a.difference(b)
c
#+END_SRC

#+RESULTS:

now, it turns out (see gis.org) that the exact way the IR data is
give, we can forget all about any of the GIS tools, and extract the
desired KML-bits with awk.  then, assuming Google Earth pays attention
to the order in which layers are defined, probably all will be good.

#+name: filelist
#+BEGIN_SRC sh :var root="/Users/minshall/work/gis/play/IR/" :var pat="doc.kml"
find ${root} -name ${pat} | sed sX^\./XXg | sort -n
#+END_SRC

#+RESULTS: filelist
| /Users/minshall/work/gis/play/IR//20160724_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160725_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160726_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160727_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160728_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160729_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160730_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160731_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160801_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160802_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160803_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160804_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160805_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160806_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160807_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160808_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160809_Soberanes_IR/doc.kml                  |
| /Users/minshall/work/gis/play/IR//20160810_c0930_Soberanes_Aircraft3/doc.kml     |
| /Users/minshall/work/gis/play/IR//20160811_c0530_Soberanes_Aircraft3_All/doc.kml |


#+name: extract_line
#+begin_src python
  def extract_line(file, trigger, select):
      """extract the first line matching SELECT that appears after the line matching TRIGGER"""
      import re
      f = open(file, 'r');
      for t in f:
          if (re.search(trigger, t)):
              for t in f:
                  if (re.search(select, t)):
                      return t;
#+end_src

#+name: extract_kmls
#+BEGIN_SRC python
  <<extract_line>>

  def extract_kmls(kmlfiles, trigger, select):
      import os
      kmls = []
      for file in kmlfiles:
          kmls = kmls + [extract_line(os.path.expanduser(file), trigger, select)]
      return kmls
#+END_SRC


okay, because of the IR doc.kml files' format, we can do all this
without worrying much about GIS APIs.

#+name: colorsub
#+BEGIN_SRC python
  def rgbtokml(rgb):
      r = (rgb/(256*256)) % 256
      g = (rgb/256) % 256
      b = rgb % 256
      bgr = (b*256*256)+(g*256)+(r)
      return bgr

  def colorsub(hexvalue, stylefrag):
      import re
      # http://stackoverflow.com/a/402704/1527747
      if type(hexvalue) is int:
          hvalue = hexvalue
      else:
          hvalue = int(hexvalue, base=16)
      return re.sub("<HEXVALUE>", "{0:x}".format(0x90000000 | rgbtokml(hvalue)),
                    stylefrag)
#+END_SRC

#+name: fragsub
#+BEGIN_SRC python
  def fragsub(fragid, stylefrag):
      import re
      # http://stackoverflow.com/a/402704/1527747
      if type(fragid) is int:
          sfrag = str(fragid)
      else:
          sfrag = fragid
      return re.sub("<FRAGID>", sfrag, stylefrag)
#+END_SRC

colors can be found [[http://www.tayloredmktg.com/rgb/][here]].


--layername "Soberanes" --featurename "Heat Perimeter"

#+name: fcomplete
#+BEGIN_SRC python :tangle program.py
  from __future__ import print_function # for eprint() below

  import sys

  <<colorsub>>
  <<fragsub>>
  <<extract_kmls>>

  fprolog1 = """<?xml version="1.0" encoding="UTF-8"?>
  <kml xmlns="http://earth.google.com/kml/2.0">
  <Document><name><DOCNAME></name>
  """

  color0 = 0xffffff
  # from http://www.personal.psu.edu/cab38/ColorBrewer/ColorBrewer.html
  # 9-class sequential PuBu
  colors = [0xfff7fb, 0xece7f2, 0xd0d1e6, 0xa6bddb, 0x74a9cf,
            0x3690c0, 0x0570b0, 0x045a8d, 0x023858]
  ncolors = len(colors)
  colorN = 0xdc0000
  nkmls = 0

  stylefrag="""<Style id="style<FRAGID>">
  <LineStyle id="lineStyle<FRAGID>">
  <color>ff000000</color>
  <width>2</width>
  </LineStyle>
  <PolyStyle id="polyStyle<FRAGID>">
  <color><HEXVALUE></color>
  </PolyStyle>
  </Style>
  """

  pprolog1="""<Placemark><name><PLACEMARKNAME></name>
  <styleUrl>#style<FRAGID></styleUrl>
  <MultiGeometry><POLYGON>"""

  ppost="""</MultiGeometry></Placemark>
  """

  fpost="""</Document>
  </kml>
  """

  # from [[http://stackoverflow.com/a/14981125][stack exchange]]
  def eprint(*args, **kwargs):
      print(*args, file=sys.stderr, **kwargs)


  def fprolog2():
      return fragsub(0, colorsub(color0, stylefrag))

  def fprolog3():
      result = ""
      for i in range(len(colors)):
          result = "{0}{1}".format(result,
                                   fragsub(i+1, colorsub(colors[i], stylefrag)))
      return result

  def fprolog4():
      return fragsub("N", colorsub(colorN, stylefrag))

  def fprolog():
      import re

      return "{0}\n{1}\n{2}\n{3}".format(re.sub("<DOCNAME>", layername, fprolog1),
                                         fprolog2(), fprolog3(), fprolog4())

  def labelit(label):
      import math

      return int(math.ceil((1.0*ncolors/nkmls)*label))

  def kmlit(label, kml, fname):
      import re
      import math
      import os.path

      placemarkname = os.path.split(os.path.split(fname)[0])[1]

      if kml == None:
          return ""
      else:
          return re.sub("<POLYGON>", kml,
                        re.sub("<FRAGID>", str(label), 
                               re.sub("<PLACEMARKNAME>", placemarkname, pprolog1))) + ppost


  def kmlfrags():
      global nkmls

      kmls = extract_kmls(kmlfiles, trigger, select)
      nkmls = len(kmls)
      labels = [0]
      for i in range(1, len(kmls)-1):
          labels = labels + [labelit(i)]
      labels = labels + ["N"]
      result = ""
      # we run the list *backwards* so that newer (more expansive)
      # layers hide under older layers, to show the growth day to day
      for i in list(reversed(range(len(kmls)))):
          kml = kmls[i]
          if kml != None:
              result = result+kmlit(labels[i], kml, kmlfiles[i])
      return result

  def main(argv):
      import argparse

      global layername, trigger, select, kmlfiles

      cmd = argv[0]
      parser = argparse.ArgumentParser(description="reduce a feature of a layer from a number of KML files to a single KML file")
      parser.add_argument('-l', '--layername', type=str, required=True,
                          help="name of desired layer (in file)")
      parser.add_argument('-f', '--featurename', type=str, required=True,
                          help="name of desired feature (within layer)")
        # use "type=str" since we use the file name for ogr.Open()
      parser.add_argument('kmlfiles', type=str, nargs="+")
      args = parser.parse_args();
      kmlfiles = args.kmlfiles
      layername = args.layername
      trigger = args.featurename
      select = "Polygon"

      print("{0}{1}{2}".format(fprolog(), kmlfrags(), fpost))

  if __name__ == "__main__":
      main(sys.argv)
#+END_SRC

*** parsing as an xml document

**** [[https://docs.python.org/2.7/library/xml.etree.elementtree.html][Element Tree]]

it [[http://stackoverflow.com/a/1912483/1527747][seems like]] [[https://docs.python.org/2.7/library/xml.etree.elementtree.html][Element Tree]] is the way to parse.

#+BEGIN_SRC python :var input="/Users/minshall/work/gis/play/IR/20160729_Soberanes_IR/doc.kml" :results output verbatim
  import xml.etree.ElementTree as et

  # set up namespace
  # http://stackoverflow.com/a/29021450/1527747
  et.register_namespace("","http://www.opengis.net/kml/2.2")
  ns = { "kml2.2": "http://www.opengis.net/kml/2.2" }

  tree = et.parse(input)
  root = tree.getroot()

  doc = root.find("kml2.2:Document", ns)

  places = doc.findall("kml2.2:Placemark", ns)

  # list comprehensions
  # https://docs.python.org/3/tutorial/datastructures.html#list-comprehensions
  hperil = [i for i in places if
            i.find("kml2.2:name", ns).text == "Heat Perimeter"]

  mg = hperil[0].find("kml2.2:MultiGeometry", ns)

  str = et.tostring(mg)
  print str[:-200]
#+END_SRC

#+RESULTS:
: <MultiGeometry xmlns="http://www.opengis.net/kml/2.2">
:                 <Polygon><outerBoundaryIs><LinearRing><coordinates>-121.89643389623,36.5015503193858,0 -121.896519056513,36.5013665883747,0 -121.896423921622,36.5011502517804,0 -121.896409924171,36.5008935978642,0 -121.896474296502,36.500715148082,0 -121.896434315018,36.5005434015718,0 -121.896144634722,36.5004128950409,0 -121.896116976317,36.5002755157464,0 -121.896214206279,36.5001133260816,0 -121.896193503321,36.4998801420744,0 -121.896082778272,36.4996969135352,0 -121.89597842322,36.4995841766391,0 -121.895847412925,36.4993831796971,0 -121.89564406908,36.4992847755604,0 -121.895525045346,36.499232640023,0 -121.895398478578,36.4990034783527,0 -121.89534986424,36.4988919992481,0 -121.895253053867,36.4986316571232,0 -121.895120954188,36.498506012834,0 -121.895110309156,36.4983563955201,0 -121.895180884132,36.4982095448316,0 -121.895156828823,36.4980377996535,0 -121.895191697815,36.4979270747597,0 -121.895260764512,36.4977101510382,0 -121.895296890896,36.4975731066254,0 -121.895303344637,36.4973708512638,0 -121.895301751934,36.4972851045988,0 -121.895210389713,36.4971316320992,0 -121.895032819464,36.4972076091947,0 -121.894973775546,36.497231514349,0 -121.894624494197,36.4972140270235,0 -121.894242782786,36.4971542631559,0 -121.893990487392,36.4971616394576,0 -121.893619252574,36.4970764786556,0 -121.893071075488,36.496881934806,0 -121.892687352615,36.4966852958465,0 -121.89244260081,36.4964431424808,0 -121.892261552551,36.4960263940334,0 -121.892117802233,36.4956176091602,0 -121.892010933276,36.4954793069702,0 -121.891930718477,36.4953850946109,0 -121.891901213911,36.4952083205369,0 -121.891899704522,36.4951141081791,0 -121.891808000189,36.4950139989231,0 -121.891792080245,36.4949933254731,0 -121.89158865313,36.4949919835111,0 -121.891497625646,36.4949632331419,0 -121.891444568073,36.4949107628879,0 -121.891409364211,36.4947940872237,0 -121.891356892234,36.4946887261472,0 -121.891240049933,36.4945852096404,0 -121.89097275031,36.494446321667,0 -121.890765633961,36.4943723096565,0 -121.890595731552,36.4942605786627,0 -121.890439745129,36.4940022486915,0 -121.890531191759,36.4938649530928,0 -121.890803687568,36.4938597562805,0 -121.890905694825,36.4938559842803,0 -121.891219178701,36.4937492824044,0 -121.891353540481,36.4937216222488,0 -121.891624946729,36.4935502960057,0 -121.891790991936,36.4934789660938,0 -121.892028618933,36.4934757811583,0 -121.892179660958,36.4936364621698,0 -121.89233707306,36.4936138307539,0 -121.892465316097,36.4935316883162,0 -121.892657847919,36.4934352137016,0 -121.89251409896,36.4931042945414,0 -121.89225199647,36.4926609757614,0 -121.892161053047,36.4925469822405,0 -121.892119814172,36.4922718878748,0 -121.892045801398,36.4921710544673,0 -121.891980753819,36.492093047429,0 -121.891919988623,36.4920201795515,0 -121.891824350864,36.4919107962784,0 -121.891768528386,36.4917937009352,0 -121.892004060557,36.4917438292202,0 -121.892161974484,36.4916059464622,0 -121.892293822106,36.4915134103668,0 -121.892401110349,36.4915334427124,0 -121.892469674712,36.4913305163233,0 -121.89242633864,36.4912462780193,0 -121.892307316688,36.4911265006029,0 -121.892419634887,36.4910581885091,0 -121.892381580859,36.4909388314372,0 -121.892383676929,36.4908168735738,0 -121.892408319085,36.4905427857406,0 -121.892416533538,36.4903569590798,0 -121.892323326192,36.4902292187225,0 -121.892157951955,36.4902241056897,0 -121.892039765417,36.4902909089802,0 -121.891969525889,36.490261907932,0 -121.891958630111,36.4901487516455,0 -121.891991654757,36.489996536871,0 -121.892099277942,36.4898552175634,0 -121.892220899615,36.4898039203825,0 -121.892375629291,36.4897854807933,0 -121.892363979162,36.4896999855923,0 -121.89220153599,36.4896326782801,0 -121.892057201435,36.4895652044685,0 -121.891936669398,36.48965815901,0 -121.891798115917,36.4897767634808,0 -121.891657133218,36.489728399648,0 -121.891575409079,36.4896219494831,0 -121.891625114207,36.4895605105135,0 -121.891540288546,36.4894487796438,0 -121.891531149333,36.4894398837182,0 -121.891512042411,36.4894212872513,0 -121.8915930946,36.4893495373618,0 -121.8916770816,36.4892859189368,0 -121.891689657301,36.4892865683371,0 -121.891772887666,36.4892908643717,0 -121.891840093824,36.4891410595562,0 -121.891846815857,36.4891260762475,0 -121.89175670953,36.4890414184981,0 -121.891667190983,36.4889774651611,0 -121.891517406142,36.4888437732652,0 -121.891507683456,36.4887286067917,0 -121.891545401902,36.4885872039789,0 -121.89152587279,36.488475556802,0 -121.891639782103,36.4883879653536,0 -121.891870117502,36.4882898972008,0 -121.89199819286,36.4883489072496,0 -121.892178654698,36.4884332279977,0 -121.892390213758,36.4884503273146,0 -121.892543351772,36.4883783267367,0 -121.89253329348,36.488252933697,0 -121.892605713215,36.4880684478954,0 -121.892703697074,36.4880210895892,0 -121.892879716928,36.4881121174401,0 -121.893049617732,36.4881771605131,0 -121.893104604103,36.488094851143,0 -121.893180543672,36.4880110315306,0 -121.893333261373,36.4879783419887,0 -121.893581199384,36.4878021545029,0 -121.893579103186,36.4877651075702,0 -121.893445913747,36.487709953573,0 -121.89329881215,36.4877128874701,0 -121.893152464324,36.4876799467936,0 -121.89309907047,36.4876264702172,0 -121.892936462926,36.4876279792112,0 -121.892764130178,36.4875679650083,0 -121.892750636171,36.4874587477776,0 -121.892564306897,36.4874273153179,0 -121.89247663126,36.4873800424207,0 -121.892393985777,36.4872476075956,0 -121.892374119428,36.4870942188677,0 -121.892471183428,36.4870603561265,0 -121.892342772068,36.4869337890137,0 -121.892223162368,36.4868003490676,0 -121.89209584127,36.4868218906497,0 -121.891950499631,36.4867859325507,0 -121.89171505159,36.4867127587422,0 -121.891508018947,36.4867063048082,0 -121.891531823386,36.4866037940825,0 -121.891623353662,36.4864691801757,0 -121.891855448301,36.4863485651861,0 -121.891889395363,36.4862908134591,0 -121.892208661964,36.4859842875159,0 -121.891991956515,36.4857778656333,0 -121.89175637856,36.4856529731269,0 -121.891451949725,36.485681258974,0 -121.890872137484,36.4857373640566,0 -121.890421884066,36.4857445937997,0 -121.890160447021,36.4857487909177,0 -121.889953920882,36.4856234279335,0 -121.889948129472,36.4853895602523,0 -121.890001014371,36.4851781463923,0 -121.889965595221,36.4849213580053,0 -121.889785805092,36.4847019811765,0 -121.889621695495,36.4845291448938,0 -121.88961561567,36.4842835836164,0 -121.889593855141,36.4839914820326,0 -121.88966242148,36.4838266090243,0 -121.889743775001,36.4835913419901,0 -121.889810603411,36.4833563085536,0 -121.889893112842,36.4831678158542,0 -121.889944838121,36.4829096284559,0 -121.890055815901,36.4826972823674,0 -121.890095333182,36.482532874747,0 -121.890162738087,36.482321227981,0 -121.890288527719,36.482120341943,0 -121.890282735564,36.4818864744853,0 -121.890275205785,36.4815824455476,0 -121.890338266487,36.4811953968303,0 -121.890426896603,36.4806675614415,0 -121.890532656259,36.4802447335237,0 -121.890769412443,36.4798314999115,0 -121.890863604394,36.4793743022548,0 -121.890719306977,36.4790866977268,0 -121.890495287632,36.4784607131846,0 -121.889988620401,36.4784085646736,0 -121.889473505049,36.4786263814973,0 -121.888883196122,36.4786739528364,0 -121.888504793375,36.478680023171,0 -121.888080975263,36.4787630205901,0 -121.88741830103,36.4787545957479,0 -121.886892819447,36.4785534694411,0 -121.886580190983,36.478348931876,0 -121.886496063159,36.477816883415,0 -121.886230267687,36.4775925427021,0 -121.885825398512,36.4774847304905,0 -121.885346288499,36.4772447548817,0 -121.885198746024,36.4770185186695,0 -121.884792000464,36.4768345324646,0 -121.884619870959,36.4765705894254,0 -121.884700173287,36.4764965602094,0 -121.884654966663,36.4764064386945,0 -121.88462739638,36.4760563613559,0 -121.884618745331,36.4757059827536,0 -121.884779992612,36.4753376430277,0 -121.885229540121,36.475147565932,0 -121.885601526752,36.47488253094,0 -121.885800827797,36.4748129317347,0 -121.885898133474,36.4746832310761,0 -121.885960141027,36.4743202891717,0 -121.885692007214,36.4740007359953,0 -121.885546524227,36.4739127564489,0 -121.885475835338,36.473942289708,0 -121.884244697736,36.4737120597677,0 -121.883707007389,36.4734533733838,0 -121.883270217553,36.472956590374,0 -121.883000922299,36.4723593540768,0 -121.882899118049,36.4716616644782,0 -121.882739531548,36.4709663461858,0 -121.881976594493,36.4708104694199,0 -121.881664201207,36.4704489516802,0 -121.880710318975,36.4700201510721,0 -121.879646742247,36.4696894196908,0 -121.879193266566,36.4698483785888,0 -121.8782431799,36.4704020130734,0 -121.87702383593,36.470358387677,0 -121.877031796143,36.4695626123595,0 -121.877224832962,36.4689464216449,0 -121.876337564957,36.468655229048,0 -121.875039958182,36.4682872478703,0 -121.87491513768,36.4679992274437,0 -121.874701244081,36.4675056668969,0 -121.873894422919,36.4666496673053,0 -121.873105186896,36.4660736879704,0 -121.871186185602,36.4660232623475,0 -121.870607049017,36.4653783644609,0 -121.870482656295,36.4652868464527,0 -121.870433683934,36.4652190451102,0 -121.87040325546,36.4651357084098,0 -121.870276937668,36.4650005564425,0 -121.870209983022,36.4649711399571,0 -121.870018949047,36.4648979753489,0 -121.869772285184,36.4648714133932,0 -121.869563827884,36.4648594848005,0 -121.86922444509,36.4649105943876,0 -121.868978479443,36.4650041219723,0 -121.868975222147,36.4650045582087,0 -121.868971422573,36.46500680535,0 -121.868913276907,36.465041183328,0 -121.868260052629,36.4654273879487,0 -121.867823736047,36.4659151471725,0 -121.86771311916,36.4666405015134,0 -121.867540870828,36.4674702044562,0 -121.867392483714,36.4679635719199,0 -121.867220860777,36.468819106274,0 -121.867044179421,36.4694679780824,0 -121.866963735413,36.4701153237406,0 -121.866900690207,36.470574938591,0 -121.866882025802,36.4707110034305,0 -121.86702614217,36.4713547868514,0 -121.867038778841,36.4718714413748,0 -121.867228755132,36.4725958746171,0 -121.866678448277,36.4728850226096,0 -121.86587705108,36.4729235704024,0 -121.864914616001,36.4729388204615,0 -121.864869805524,36.4729603914983,0 -121.864957879946,36.4732033933981,0 -121.864943289728,36.4731913288847,0 -121.865322115378,36.4735407778948,0 -121.865706505245,36.4735086552887,0 -121.865915114787,36.4733794550992,0 -121.866756497656,36.4733993744564,0 -121.866712346666,36.4737948893788,0 -121.866683166654,36.4739734981798,0 -121.866440026047,36.4742430952617,0 -121.865916848213,36.4742739012158,0 -121.865323635718,36.4742467954322,0 -121.864721669493,36.4742124479812,0 -121.864156077858,36.4741140448299,0 -121.863812264874,36.4739962846384,0 -121.863433750129,36.4738281048871,0 -121.863160389682,36.4737396356065,0 -121.862822720641,36.4738079724252,0 -121.862394792572,36.4739899347682,0 -121.862126002929,36.4741948794988,0 -121.861529234721,36.4744110056872,0 -121.861381569296,36.4742092445923,0 -121.86083296644,36.4741610758577,0 -121.860224821969,36.4745488172605,0 -121.860449279542,36.4749516652467,0 -121.861059047143,36.4752604003129,0 -121.861363357088,36.4754541160855,0 -121.861167531566,36.4759197354568,0 -121.861178339521,36.4763920970534,0 -121.861143924357,36.4767256886752,0 -121.861646274959,36.4767066308379,0 -121.861230768092,36.47684577469,0 -121.860990692233,36.4771058489929,0 -121.861208151463,36.4773822160826,0 -121.86149734355,36.4778023758294,0 -121.862106019785,36.4775815934014,0 -121.862650056531,36.4777418146704,0 -121.862955242395,36.4780786433651,0 -121.862787948132,36.4784109690896,0 -121.862051088966,36.4783085382139,0 -121.861640458129,36.4781138098839,0 -121.861471937041,36.4785296020099,0 -121.861234125031,36.4786346640239,0 -121.860823669169,36.4784280088512,0 -121.860429552056,36.4781141769008,0 -121.860613191816,36.4776746791965,0 -121.860677837796,36.4772936735988,0 -121.860311510278,36.4770993637488,0 -121.860111264936,36.4766561994689,0 -121.860353612217,36.4762411143034,0 -121.860416337487,36.475991273311,0 -121.859929454661,36.4759627709253,0 -121.859952254089,36.4754144057477,0 -121.859787938619,36.4749381921204,0 -121.859284097553,36.4746566998676,0 -121.859513827519,36.474296353952,0 -121.859169253921,36.4738279569936,0 -121.859199185107,36.4735992693182,0 -121.859307460757,36.473510923537,0 -121.859245682506,36.4734161267418,0 -121.858918678029,36.4732994788684,0 -121.858510755066,36.4734200012193,0 -121.857906126286,36.473366512821,0 -121.857926556027,36.4732415505285,0 -121.857476805155,36.4732631505972,0 -121.857310741989,36.4730331858249,0 -121.857310078181,36.4730059041355,0 -121.856962799959,36.4732501488188,0 -121.856487021081,36.4734721789585,0 -121.856164488633,36.4733140533189,0 -121.856109638116,36.4730273102907,0 -121.855566174307,36.4728312877813,0 -121.855432071006,36.4729134815704,0 -121.855150502631,36.4729823347546,0 -121.854931498307,36.4728132733232,0 -121.854576460868,36.4728575686786,0 -121.853975877708,36.4725298077725,0 -121.853949861227,36.4722910435724,0 -121.854115599177,36.4720660466258,0 -121.853632080533,36.471810962412,0 -121.853473191635,36.4715709215261,0 -121.853045570354,36.4715310349289,0 -121.852429009717,36.4712865927445,0 -121.852419871457,36.4709048819098,0 -121.852037424515,36.4708057975735,0 -121.851759554785,36.4706242383361,0 -121.851421224756,36.4705375022606,0 -121.851038604963,36.4704503387938,0 -121.85088007887,36.4701864465471,0 -121.851060936342,36.4699377479653,0 -121.850638255118,36.4695639802788,0 -121.850557245995,36.4690503940983,0 -121.850754097187,36.4687183699418,0 -121.850203984845,36.4689754365093,0 -121.85003700953,36.4692838961958,0 -121.849796568513,36.4695677960873,0 -121.849970205404,36.469807983957,0 -121.849591894678,36.4702288929077,0 -121.849499472078,36.4701904488925,0 -121.849290742662,36.4705234889271,0 -121.849137224809,36.4708101701202,0 -121.84881767225,36.4708668741294,0 -121.848328960055,36.4705644369458,0 -121.847839627751,36.4702361641437,0 -121.847760841792,36.4702151535844,0 -121.847624102265,36.4704174133482,0 -121.847320596358,36.4705719013653,0 -121.846446988475,36.4709355415522,0 -121.845829676234,36.4707435312955,0 -121.845229446505,36.4705946157289,0 -121.844152582198,36.4703265945141,0 -121.844035156272,36.469881820676,0 -121.84485285477,36.4697036979696,0 -121.84489083469,36.469532335385,0 -121.844236618595,36.4694401356966,0 -121.843652417619,36.469405854327,0 -121.843102585818,36.4694434575655,0 -121.84238304156,36.4689785322575,0 -121.841819754181,36.4687297820714,0 -121.841613339648,36.4683127638467,0 -121.841422726306,36.4680246963314,0 -121.841082508621,36.4682646771783,0 -121.840801401852,36.4681045274582,0 -121.840361495462,36.4678999014605,0 -121.840259252131,36.4676270016859,0 -121.839850942571,36.4676802761975,0 -121.839783065983,36.4674792643815,0 -121.839433876062,36.4671324084489,0 -121.839014468158,36.4667419358229,0 -121.838627719994,36.4665378206467,0 -121.837972469468,36.4665171310051,0 -121.837779737913,36.4663721456038,0 -121.838215152095,36.4656894645522,0 -121.838326993415,36.4653184711651,0 -121.838295833537,36.4650319507678,0 -121.838528688801,36.464862487083,0 -121.8390249185,36.4648530049011,0 -121.839538223188,36.4648866192658,0 -121.839598405399,36.4644149462194,0 -121.839954193207,36.464318229291,0 -121.840128143339,36.4645345829647,0 -121.840426737723,36.4647092150311,0 -121.840836096461,36.464584394292,0 -121.840435901202,36.4640939371642,0 -121.840663703227,36.4640135772708,0 -121.840592786865,36.4639651242852,0 -121.840434097796,36.4635151736468,0 -121.840455048259,36.4631576611748,0 -121.840293796739,36.4629776520878,0 -121.839900347418,36.463175699306,0 -121.838213841831,36.463402577225,0 -121.838024961031,36.4630000342575,0 -121.837445939253,36.4626223127204,0 -121.837104024056,36.4629767528389,0 -121.837307623133,36.4635797926064,0 -121.837532571739,36.4639397554327,0 -121.836767421506,36.4641612732662,0 -121.835969832481,36.4641821178121,0 -121.835602745641,36.4638493870218,0 -121.835167158479,36.4633585671301,0 -121.835189774749,36.462873172923,0 -121.8351372914,36.4624337944425,0 -121.835403521397,36.4620070671372,0 -121.835400093935,36.4614465251273,0 -121.835691114333,36.4609413292658,0 -121.835925994731,36.4606359370832,0 -121.836344302509,36.4605040634199,0 -121.836107411002,36.460351489296,0 -121.835729986761,36.4601188340467,0 -121.835077038988,36.4599478873585,0 -121.834833114672,36.4596735997603,0 -121.834749685007,36.4593293245219,0 -121.834087066102,36.4586216207321,0 -121.833752023208,36.4583202041421,0 -121.834152715693,36.4581810104706,0 -121.835023264006,36.4582133629381,0 -121.835391756842,36.4582527365726,0 -121.835630430715,36.4580881053147,0 -121.835896665069,36.4580549253396,0 -121.83621517224,36.4584754319454,0 -121.836388030209,36.4587633347613,0 -121.836801878777,36.4587315919495,0 -121.837344483447,36.4589753937298,0 -121.837528904048,36.45947807054,0 -121.837613556517,36.4597412609383,0 -121.837180668084,36.4600590382799,0 -121.837428052734,36.4602999628336,0 -121.837668152664,36.4600399357006,0 -121.838227131756,36.4601765615053,0 -121.838057638315,36.4606519401901,0 -121.838111880875,36.4609744627198,0 -121.838755402763,36.4613377852291,0 -121.838752273402,36.4612078541694,0 -121.839189882922,36.4609628945845,0 -121.839335369349,36.4608653713861,0 -121.839210263732,36.4605815794218,0 -121.839054456709,36.4602506412278,0 -121.839341986045,36.4599127768652,0 -121.839453901105,36.4596490930387,0 -121.839474853064,36.459291580736,0 -121.839527082453,36.4590050168783,0 -121.839609439258,36.458741795268,0 -121.83975262656,36.4585490579082,0 -121.839775871886,36.4582867594887,0 -121.839087504857,36.4579403320866,0 -121.838869728228,36.4574913001051,0 -121.838838861139,36.4574568386911,0 -121.838520120238,36.4575581393212,0 -121.838320224341,36.4574989502593,0 -121.838025004517,36.4574960762868,0 -121.837705740051,36.4575215891574,0 -121.837457185785,36.4575573305623,0 -121.83724420014,36.4575838774116,0 -121.836877984835,36.4575898494606,0 -121.836325109289,36.4574413512379,0 -121.836611797468,36.4572247129254,0 -121.836896774484,36.4571225441861,0 -121.836544080175,36.4570141600437,0 -121.836320712384,36.4569451982495,0 -121.836194380405,36.4567054518941,0 -121.836339362583,36.456487432261,0 -121.836412637224,36.4563259568194,0 -121.836879425529,36.4567025895809,0 -121.837163545706,36.4566576553119,0 -121.837358322903,36.4562683891103,0 -121.837279792654,36.4559909471936,0 -121.837697790209,36.4556801795145,0 -121.83820626792,36.4556374274855,0 -121.838680648931,36.455988708148,0 -121.838694018932,36.4559244168355,0 -121.838657586366,36.4556392380126,0 -121.838637471621,36.4555334368467,0 -121.838732706797,36.4555781520283,0 -121.838829806965,36.4556005631006,0 -121.838951663225,36.455744857379,0 -121.839136901127,36.4557967473546,0 -121.839446981912,36.4557926075972,0 -121.83957982799,36.4557938993408,0 -121.839783845059,36.4557744165198,0 -121.839687597073,36.4556947709969,0 -121.839449753735,36.4556065931513,0 -121.839300048191,36.4555478937942,0 -121.839213403756,36.4554182532199,0 -121.839134869501,36.4553387795387,0 -121.83922417942,36.4552895601284,0 -121.839207426387,36.4552249982386,0 -121.839014613206,36.4550871694231,0 -121.83888422149,36.4549213258451,0 -121.838794108984,36.4548698173393,0 -121.838867646985,36.4545405882734,0 -121.838886307839,36.4540878620879,0 -121.838880440989,36.4538442630662,0 -121.838613817509,36.4536218065703,0 -121.838475297297,36.453409081787,0 -121.838286726366,36.4529643439979,0 -121.83788462722,36.4528353106348,0 -121.837861015607,36.4528277335474,0 -121.837655394332,36.4525981485641,0 -121.837229256698,36.452443634949,0 -121.836829219591,36.4524498789651,0 -121.836469325397,36.4522764217307,0 -121.83568200867,36.4518947426807,0 -121.835281953054,36.4517683882946,0 -121.834590646605,36.4514574371478,0 -121.833846690108,36.4512547208887,0 -121.833470124793,36.4511401493068,0 -121.833383453225,36.4511897886196,0 -121.833194671053,36.4511784026318,0 -121.833158673893,36.4510493511172,0 -121.832536673798,36.4508703155695,0 -121.831731912359,36.4505970959218,0 -121.831194265299,36.4503673392214,0 -121.830271305313,36.4500959476376,0 -121.830055884236,36.4497421130558,0 -121.830253617856,36.4493580397707,0 -121.830256184127,36.4492959464356,0 -121.830118156839,36.4492210887868,0 -121.830061268221,36.4490774223915,0 -121.830270202367,36.4489567595779,0 -121.830272328524,36.4489053145001,0 -121.830441648395,36.448569307418,0 -121.830639947716,36.4482090371044,0 -121.830715475218,36.4476601785552,0 -121.830729047872,36.4469932206514,0 -121.830868811183,36.4466576723686,0 -121.830919349258,36.446299699888,0 -121.830939769507,36.4459183842917,0 -121.830785169658,36.4456350413076,0 -121.830598738576,36.4452569423831,0 -121.830944777411,36.4448943737387,0 -121.831284534352,36.4442699644304,0 -121.831361195024,36.4437687106019,0 -121.831172482484,36.4432953995962,0 -121.830901972929,36.4431091083315,0 -121.830279727461,36.4430473507605,0 -121.829971328208,36.4429927757945,0 -121.829594880236,36.4431767656411,0 -121.829519741848,36.4434622466621,0 -121.829577198808,36.4435677566033,0 -121.829621702974,36.4437494642565,0 -121.829491542968,36.4437672691185,0 -121.829232656123,36.4437074865455,0 -121.829044752978,36.4436388591982,0 -121.828912872576,36.4437711336612,0 -121.829062775473,36.4440111191019,0 -121.828873007838,36.4440665008869,0 -121.828776259837,36.4442182010637,0 -121.828410968085,36.4441669131618,0 -121.82824395237,36.4442797608016,0 -121.827898830216,36.4444576435029,0 -121.827676367389,36.4443314310897,0 -121.82729869489,36.4443181805448,0 -121.827231443915,36.4440790050503,0 -121.827472458892,36.4437569927764,0 -121.827415291789,36.4436324035128,0 -121.827252295946,36.4434781527173,0 -121.827102605631,36.4434274009074,0 -121.827041842869,36.4436215383989,0 -121.826673642849,36.4442940015153,0 -121.826582710313,36.4443249514672,0 -121.826634356609,36.4445215446712,0 -121.826609019149,36.4446357826566,0 -121.82660557131,36.4448647228857,0 -121.826416805729,36.4448533264593,0 -121.826124078302,36.4446882579402,0 -121.825732441175,36.4448179739017,0 -121.825519630861,36.4448349612659,0 -121.825364272634,36.4449574601093,0 -121.825679750471,36.4451799978327,0 -121.825466220146,36.4452446809415,0 -121.824946573523,36.4452491069478,0 -121.824698053456,36.4452848224521,0 -121.824672137287,36.4454372166303,0 -121.824540390383,36.4455599468649,0 -121.824267535542,36.4456431247325,0 -121.824056450443,36.4455456394422,0 -121.823877474641,36.4456679036199,0 -121.82394529247,36.4458689241189,0 -121.823731758887,36.4459336040568,0 -121.82336487818,36.4459872314388,0 -121.82284508261,36.4460011873642,0 -121.822819450813,36.4461345027298,0 -121.822320672778,36.4463203941186,0 -121.822223188214,36.4465197844372,0 -121.821781422116,36.4468398042102,0 -121.821260466156,36.446930066364,0 -121.821192510117,36.4467385836379,0 -121.82099264269,36.446608485461,0 -121.820742224121,36.446702816891,0 -121.819554008106,36.4468583539889,0 -121.819067664317,36.4467428585787,0 -121.818673566212,36.446649268214,0 -121.818483111512,36.4466830243788,0 -121.817655125501,36.4466720030097,0 -121.817614805466,36.4466557762146,0 -121.817356150492,36.4466386195215,0 -121.81693113226,36.4464376331556,0 -121.816830409314,36.4462571197894,0 -121.816376091159,36.4458838130516,0 -121.816122585785,36.4457683661963,0 -121.815245460804,36.4446846271352,0 -121.815175413504,36.444252363466,0 -121.814960615705,36.4439989842532,0 -121.814431122656,36.442864157601,0 -121.814337385195,36.4426512910616,0 -121.814264217221,36.4421997327248,0 -121.814096424597,36.4421126650259,0 -121.814134021266,36.4419699298512,0 -121.814217638161,36.4419122661396,0 -121.814198828893,36.4417961825996,0 -121.814291706429,36.4413190343568,0 -121.81418907068,36.4411888760312,0 -121.813969848182,36.4411191870337,0 -121.813702516786,36.4408398536368,0 -121.813855619662,36.4407660039647,0 -121.813612646263,36.440457869339,0 -121.81274538154,36.4397854364977,0 -121.812891710436,36.4387773477441,0 -121.813663157118,36.4378053437504,0 -121.814325468366,36.4370178974226,0 -121.814698687054,36.4360063056198,0 -121.814669912668,36.4358186852245,0 -121.814301523026,36.4356175641737,0 -121.814305586304,36.4353504680087,0 -121.814573153963,36.4351877740467,0 -121.814551546342,36.4350468811494,0 -121.814242532103,36.4345292433251,0 -121.813570965275,36.434422422527,0 -121.813208905436,36.4342359178317,0 -121.812878121269,36.43449670897,0 -121.812740236737,36.4342472823372,0 -121.812733203297,36.4339908706737,0 -121.81238663484,36.4338123423607,0 -121.812036579518,36.4339349830012,0 -121.81158420382,36.4341785356152,0 -121.810928936595,36.4337903868047,0 -121.811243433886,36.4332974083727,0 -121.811467087245,36.433185505909,0 -121.811003442734,36.4328683936328,0 -121.810766383839,36.432684562945,0 -121.810525756835,36.4324772582573,0 -121.810357900123,36.432525339588,0 -121.809889199912,36.4322916936642,0 -121.809565656624,36.4318305193437,0 -121.809049744014,36.4315963993381,0 -121.80918294897,36.4321510824112,0 -121.809174788208,36.4326852740223,0 -121.808655372215,36.4326800914903,0 -121.80815985787,36.4326560641567,0 -121.807293885196,36.4321513046372,0 -121.807699918189,36.4318500618406,0 -121.807730822805,36.4313733410354,0 -121.80754895173,36.430913576164,0 -121.807820616269,36.4301339610065,0 -121.80850411206,36.4302171095279,0 -121.8084866266,36.4298162301199,0 -121.807639914558,36.4295978831416,0 -121.808214985718,36.4290502711357,0 -121.809116488484,36.4287730496703,0 -121.810084442779,36.4287827015835,0 -121.810658035673,36.4283304687777,0 -121.811157887528,36.4280683107817,0 -121.812124089656,36.4281924158216,0 -121.812441752567,36.4274895718259,0 -121.813290489076,36.4275743364353,0 -121.814611684559,36.4276447059625,0 -121.815406831359,36.4281487099542,0 -121.81584413882,36.4283906238087,0 -121.81625375569,36.4281145844193,0 -121.816358685963,36.427773923166,0 -121.816347817547,36.4273168906203,0 -121.816686935551,36.4266639543598,0 -121.81695605237,36.4260501979441,0 -121.817060179207,36.4254580398245,0 -121.817372025421,36.4246531213459,0 -121.817448889086,36.4239089817416,0 -121.817626175794,36.4234109421275,0 -121.8179657201,36.4227770432626,0 -121.818309337204,36.4223145325131,0 -121.818505259496,36.4216066511567,0 -121.818706166921,36.4211082441023,0 -121.818976606977,36.4205516110244,0 -121.819359764086,36.4197646320977,0 -121.819397049373,36.4193449528496,0 -121.819391549697,36.419114044217,0 -121.819351763441,36.4190935481429,0 -121.818639176303,36.4189521652663,0 -121.818170832174,36.418786684229,0 -121.817990719657,36.418660032564,0 -121.817565837278,36.4183612589532,0 -121.81717074464,36.4184358927425,0 -121.816681408983,36.4181236452815,0 -121.816335933725,36.4179005465912,0 -121.815937043843,36.4178153323104,0 -121.815496696185,36.4176183232202,0 -121.815111779063,36.4177493382396,0 -121.813972035029,36.4175383176975,0 -121.813109547086,36.4170563112743,0 -121.811969818934,36.4168452718212,0 -121.81165639829,36.4165215900212,0 -121.811427298559,36.4165142668116,0 -121.811117219797,36.4165875707236,0 -121.810693795258,36.4166626185048,0 -121.810421944064,36.4166288161759,0 -121.810205560584,36.4167155270098,0 -121.809675548091,36.4167951193157,0 -121.808796700296,36.4171181991948,0 -121.808326887951,36.4172444854951,0 -121.807945130764,36.4173456037306,0 -121.807416621892,36.4173707802376,0 -121.807136235629,36.4175218741115,0 -121.806664505279,36.4175672187643,0 -121.806337264994,36.4177246448174,0 -121.805699210884,36.4177344403805,0 -121.80539199873,36.4177391555416,0 -121.804920266723,36.4177844948336,0 -121.804567139902,36.4178470620966,0 -121.80373463539,36.4176312288347,0 -121.803381510351,36.417693792512,0 -121.802836633689,36.4176449943293,0 -121.802480811873,36.4175932975987,0 -121.801931443154,36.4173540627766,0 -121.801360694752,36.4172104031739,0 -121.80109760586,36.4170810810882,0 -121.80059550997,36.4168411174116,0 -121.799621812452,36.4166401599497,0 -121.799333968036,36.417005847299,0 -121.799041667013,36.4171125406471,0 -121.798763918015,36.417364438342,0 -121.798536208162,36.4175377245325,0 -121.798338688099,36.417548713662,0 -121.798077047459,36.4175527130676,0 -121.797971209036,36.4175101217846,0 -121.797434742179,36.4177657559002,0 -121.797048179223,36.4179145365028,0 -121.796303778033,36.4179259055723,0 -121.795800796966,36.4176478340966,0 -121.795044316902,36.4171450295223,0 -121.794572765606,36.4166950235577,0 -121.794587950623,36.4166771879832,0 -121.794245723298,36.4157236268036,0 -121.793673425101,36.4155795336247,0 -121.792962536869,36.4155903709036,0 -121.792109471816,36.4156033699514,0 -121.792224769858,36.4144554568688,0 -121.792485821209,36.4134581441449,0 -121.792942703705,36.4127252820204,0 -121.792790672372,36.4123073412228,0 -121.7923990037,36.4117784358944,0 -121.792248769158,36.4114368779876,0 -121.792897888675,36.410815701592,0 -121.793182563342,36.410361792047,0 -121.793697448436,36.4108560419799,0 -121.794752955305,36.4112960281932,0 -121.796339550046,36.4117413600811,0 -121.796393741022,36.4110979152783,0 -121.796054047126,36.4101642811932,0 -121.796022489145,36.4093410853192,0 -121.795095818765,36.4090030439774,0 -121.79534607937,36.4088840889253,0 -121.795575567333,36.4087008039021,0 -121.7955456255,36.4086922848221,0 -121.795116338526,36.4078292987241,0 -121.79517219313,36.4070785390164,0 -121.794606290747,36.4064646135837,0 -121.794264425858,36.4056740613788,0 -121.793482809458,36.4047001792024,0 -121.793320183298,36.4037683258409,0 -121.792489917765,36.4030801640394,0 -121.79140025554,36.4019958209438,0 -121.790221568757,36.4009463434311,0 -121.790103792358,36.3999791625563,0 -121.790248185597,36.3992293015794,0 -121.79092356036,36.3984848175103,0 -121.790218908002,36.3982630170587,0 -121.789471675786,36.3979334488627,0 -121.789038072351,36.3973566154193,0 -121.788509872152,36.3971723714565,0 -121.787789682534,36.39795216435,0 -121.786851014678,36.3985508468077,0 -121.785775133123,36.3994343450887,0 -121.784349130542,36.4000638285448,0 -121.782889455405,36.4000131829553,0 -121.781662198451,36.3992493451493,0 -121.781316937427,36.3982142434965,0 -121.781761748015,36.3980697099257,0 -121.781772915011,36.3973542777826,0 -121.782329269617,36.3971512510094,0 -121.781750000354,36.3964596113336,0 -121.781721502634,36.3959226609428,0 -121.78192168229,36.3949110122602,0 -121.782402879876,36.3947966616166,0 -121.782866726243,36.3934299256885,0 -121.783325909705,36.3923612845207,0 -121.783406693798,36.3920823268849,0 -121.78264710638,36.3920598501404,0 -121.782309224375,36.3917975326717,0 -121.781967783693,36.391382446088,0 -121.781250887263,36.3911258682529,0 -121.780019071994,36.391144520236,0 -121.778990104023,36.3917331735526,0 -121.777914630183,36.3923607257788,0 -121.776685458084,36.3924939192232,0 -121.776010622482,36.3920074419953,0 -121.775994645481,36.3913199842782,0 -121.77563904116,36.3902938064745,0 -121.775295866919,36.3898023166276,0 -121.77424027918,36.3892451651397,0 -121.773509248769,36.3883774657896,0 -121.773204611025,36.3875033333841,0 -121.773293158858,36.387234559719,0 -121.773331671409,36.3868519236519,0 -121.773370183587,36.3864692880559,0 -121.773026155712,36.3859395977333,0 -121.772596243635,36.38579325708,0 -121.77226196651,36.3856836787906,0 -121.772015354881,36.3852671341328,0 -121.771999415249,36.384579674908,0 -121.77245809304,36.383923267447,0 -121.772735243808,36.3836134458693,0 -121.773196567771,36.3830716105821,0 -121.773234192579,36.3826507813222,0 -121.773265614058,36.3819626070559,0 -121.773261183399,36.3817716449704,0 -121.773347952061,36.3814264860577,0 -121.773386461424,36.3810438495292,0 -121.7736091369,36.3804292006568,0 -121.773796847795,36.3803499577301,0 -121.7739818989,36.3801561379497,0 -121.774539706786,36.3796892527799,0 -121.774584417278,36.379573960717,0 -121.774471942421,36.3788115448007,0 -121.774458642068,36.3782386600195,0 -121.774396135212,36.3775608284882,0 -121.774183977573,36.3775752362645,0 -121.774069007804,36.3773832435831,0 -121.774013020418,36.3771918561987,0 -121.773822639811,36.3771064214083,0 -121.77345362935,36.3771264843275,0 -121.773190458841,36.3769806720793,0 -121.772989642517,36.3766208354767,0 -121.772608324695,36.3764857340281,0 -121.772418884381,36.3763406777001,0 -121.772599949987,36.376080170893,0 -121.772943398796,36.3758094062314,0 -121.772590825835,36.3757223032209,0 -121.772476799542,36.3754706897132,0 -121.772540089625,36.3751970467492,0 -121.772577074386,36.3747203948449,0 -121.772253434438,36.374669365571,0 -121.771646078121,36.3748420083209,0 -121.771428841435,36.374589332404,0 -121.771079464787,36.3742995192853,0 -121.770407018134,36.3739228993765,0 -121.770356109761,36.3734095659908,0 -121.77072510315,36.3733895123109,0 -121.771245294719,36.3731324969129,0 -121.771376674786,36.3728428587632,0 -121.771450149289,36.3726718829251,0 -121.771557660373,36.3725871228481,0 -121.77178522735,36.372370028171,0 -121.77179987245,36.3721889065468,0 -121.771527973634,36.3722242731515,0 -121.771325648004,36.372336679916,0 -121.77109423734,36.3720480801583,0 -121.771038560854,36.3718376132268,0 -121.771029166325,36.3716848662946,0 -121.771326604824,36.3715257351503,0 -121.771858751973,36.3714453417613,0 -121.772052427693,36.3711324916019,0 -121.772211015475,36.3708001991671,0 -121.772168931128,36.3704753846604,0 -121.771770888792,36.3702804797383,0 -121.771094954955,36.3705025033434,0 -121.770358238824,36.3708383851283,0 -121.769835336399,36.3710810579839,0 -121.769524298309,36.371354533023,0 -121.76945931085,36.3717354892153,0 -121.768949247444,36.3719115058603,0 -121.768528818156,36.3716400343454,0 -121.768166917879,36.3713977868665,0 -121.767812000776,36.3714609108027,0 -121.767699011482,36.3711449041287,0 -121.767621710147,36.3708101842505,0 -121.767909312299,36.3705269318179,0 -121.767948007808,36.3703174368263,0 -121.767535021832,36.370322717209,0 -121.76736320942,36.3699965626244,0 -121.767188689033,36.3698421113849,0 -121.767285910523,36.369661842515,0 -121.766922367123,36.3695245214017,0 -121.766974064199,36.3692388357843,0 -121.767140701321,36.3691451492839,0 -121.767011406618,36.3691151928826,0 -121.766897219287,36.3688754981631,0 -121.76704146985,36.3687052555573,0 -121.766476963976,36.3685944806509,0 -121.766385917175,36.3683836463209,0 -121.766674267405,36.3680527012226,0 -121.767454088809,36.3679748840913,0 -121.767597132772,36.3678809534723,0 -121.767224360677,36.36758134714,0 -121.767230380816,36.3671997834668,0 -121.76796316437,36.3671119368498,0 -121.768529315683,36.3671177745291,0 -121.768602640283,36.3669563393958,0 -121.76830987555,36.3668197521138,0 -121.768271534565,36.3665579430565,0 -121.768216921842,36.3662807011598,0 -121.76770959967,36.3662850095695,0 -121.767406398646,36.3660624466126,0 -121.767377485193,36.3656519004358,0 -121.767779704853,36.3655797247862,0 -121.768006809947,36.3653912541623,0 -121.76775957553,36.3653600822373,0 -121.767431133708,36.3652422061127,0 -121.7672194341,36.3652018590614,0 -121.766956191427,36.3654376584216,0 -121.766791820321,36.3653882584683,0 -121.766641954112,36.3651672763882,0 -121.766644212545,36.3650241899871,0 -121.766717237812,36.3648818341807,0 -121.766979726675,36.3646937307801,0 -121.767112024149,36.3645329051808,0 -121.766784791125,36.3643387145842,0 -121.766598489848,36.3641841408478,0 -121.766628100919,36.3638028205867,0 -121.766550057715,36.3635157953174,0 -121.766507698865,36.3632100571446,0 -121.766993971183,36.363043345335,0 -121.767008775501,36.3628526851017,0 -121.767058661161,36.3626814682304,0 -121.766881598479,36.3626891813547,0 -121.766524160627,36.36291446694,0 -121.766362354999,36.3627029018449,0 -121.766306396071,36.3625115109488,0 -121.765999899713,36.3624988047479,0 -121.765633227564,36.3625618012136,0 -121.765435440045,36.3623880256923,0 -121.765355141958,36.3622440860899,0 -121.765406688453,36.3619679399214,0 -121.765740537026,36.3617424139258,0 -121.766062137874,36.3615453824257,0 -121.765815669693,36.3614665112225,0 -121.765555750657,36.3614924477011,0 -121.765383211459,36.3612139858025,0 -121.765493575763,36.3609479880326,0 -121.765734726038,36.3606165568514,0 -121.765939890419,36.3603229160466,0 -121.765753449551,36.3601778802039,0 -121.765640483622,36.3598618714696,0 -121.765951488085,36.3595884054146,0 -121.766048096536,36.3594462934609,0 -121.766874254365,36.35941666113,0 -121.766949681557,36.3591216792809,0 -121.767180079555,36.3587233493976,0 -121.767493480846,36.3582972533781,0 -121.767782191687,36.3580903370003,0 -121.768068692667,36.3578738564566,0 -121.768757219287,36.3575947344613,0 -121.769136860882,36.357455536449,0 -121.769435449516,36.3572200957589,0 -121.769710900188,36.3569557940394,0 -121.770126217038,36.3567978788668,0 -121.770306717765,36.3565707609045,0 -121.770161810449,36.3560349920794,0 -121.770591015035,36.3557436488462,0 -121.771048396969,36.3559105458898,0 -121.771599076888,36.3561451851766,0 -121.772059310614,36.3561308350218,0 -121.772340698922,36.3562386741488,0 -121.773115943239,36.3564446066582,0 -121.773674251057,36.3565695970897,0 -121.774232560732,36.3566945849432,0 -121.774425323177,36.3566250074908,0 -121.774163527708,36.3563957307468,0 -121.773753383591,36.3562245600808,0 -121.773757685881,36.3559503099983,0 -121.774127344118,36.3558825484937,0 -121.774551854921,36.3560777169136,0 -121.774817949099,36.3560327426321,0 -121.774604117146,36.3555654419216,0 -121.775006058548,36.3553191211905,0 -121.775189120026,36.3549274452976,0 -121.774858106782,36.3544112402446,0 -121.775331318532,36.3543206850739,0 -121.775931971519,36.3545653573647,0 -121.776478889013,36.3544755527695,0 -121.776111762987,36.3539112778927,0 -121.77531985463,36.3536407945323,0 -121.774766423716,36.3532057899882,0 -121.773587523262,36.3531698428237,0 -121.772765401087,36.3529467358549,0 -121.771996253401,36.3531057946402,0 -121.771690266063,36.3526876300169,0 -121.771845242141,36.3522074192101,0 -121.772721487671,36.3519874470764,0 -121.773261849783,36.3521265659126,0 -121.773797126821,36.3525900130748,0 -121.77429451211,36.3524615472913,0 -121.775068940073,36.3527175471371,0 -121.775682691781,36.3521591543757,0 -121.77566723521,36.3521574748477,0 -121.775186160771,36.3517837311366,0 -121.775175659781,36.3513314403945,0 -121.774933468659,36.3510731540543,0 -121.774956904338,36.3508108560643,0 -121.775244305968,36.3504731309497,0 -121.775680930261,36.350204591041,0 -121.776059077895,36.3499607454724,0 -121.776176025681,36.3499113517956,0 -121.776379303556,36.3497654010123,0 -121.776221782336,36.3493391453194,0 -121.776334856531,36.3491231184354,0 -121.776681272718,36.3487844974013,0 -121.777031004609,36.3485887054641,0 -121.777032830436,36.3485682615451,0 -121.776747337291,36.3485545891653,0 -121.776296551899,36.3487217055026,0 -121.776245501746,36.3489692404066,0 -121.775771427361,36.3491170348237,0 -121.775036130369,36.3493766376535,0 -121.774422040306,36.349427584288,0 -121.773693618489,36.3492483780499,0 -121.773650340016,36.3489998761765,0 -121.7743163807,36.3486441646286,0 -121.773799624535,36.3485052929416,0 -121.772853866451,36.3486482341286,0 -121.772624614016,36.3482260894546,0 -121.772364291648,36.3482806591098,0 -121.771866930222,36.3484091173909,0 -121.771535554893,36.3484820362258,0 -121.771671064839,36.3488650565357,0 -121.77107516369,36.3492596373441,0 -121.770994814359,36.3498694141632,0 -121.770410303599,36.3495390173505,0 -121.770031453335,36.3496305247161,0 -121.769632620516,36.3494928489063,0 -121.769378597984,36.3491467685168,0 -121.768723347235,36.3488156348986,0 -121.768347804511,36.3486972761916,0 -121.767786897913,36.3483671099677,0 -121.767318962649,36.3479377232534,0 -121.766964076808,36.3480056164968,0 -121.76653755988,36.3479415849624,0 -121.766169438761,36.3479139324702,0 -121.76587275893,36.3480301268749,0 -121.765564538557,36.3479434620066,0 -121.765221190079,36.3482142085403,0 -121.765152763138,36.3478795778399,0 -121.765422411194,36.3476080699801,0 -121.765587749459,36.3474070389337,0 -121.765295589636,36.3472370584171,0 -121.765402533326,36.3469996466403,0 -121.765199943287,36.3467590363051,0 -121.764831639965,36.3467433036968,0 -121.764525121445,36.3465493211957,0 -121.764290041193,36.3464991868574,0 -121.763802125913,36.3465895465722,0 -121.763449129107,36.3465381905486,0 -121.763586876259,36.3462176183023,0 -121.763853884793,36.34611304839,0 -121.764257128582,36.345783295904,0 -121.76441036408,36.3454151794328,0 -121.76416846252,36.3448640888646,0 -121.764172608196,36.3446017631449,0 -121.764016507155,36.3442185214614,0 -121.763545041887,36.3442017178317,0 -121.763652174938,36.3439523836307,0 -121.763746076179,36.3436075056441,0 -121.764236233861,36.3433740589678,0 -121.764612055648,36.3429128370544,0 -121.764689328958,36.3426870448059,0 -121.764886019175,36.3423670801094,0 -121.764700441219,36.3419835344992,0 -121.765148252372,36.3416303875922,0 -121.765596059483,36.3412772389087,0 -121.765940504396,36.3409349469106,0 -121.766575955644,36.3408341751807,0 -121.766365854243,36.3410705233907,0 -121.765948281654,36.3413762838493,0 -121.765839842485,36.3417090877924,0 -121.765438132551,36.341943455111,0 -121.765226706861,36.3422632684969,0 -121.765354461938,36.3425746607447,0 -121.765345614324,36.3431350842991,0 -121.765163474707,36.3434671259337,0 -121.764567696627,36.3438545204503,0 -121.764501958325,36.344283171233,0 -121.765546935838,36.3443893784923,0 -121.766399553824,36.3445412942395,0 -121.766587966978,36.3447459787205,0 -121.766785667189,36.3452966083531,0 -121.767406225755,36.3452076047202,0 -121.768013358619,36.3450349784729,0 -121.768929451689,36.3449013102752,0 -121.769315677038,36.34471447529,0 -121.770250816445,36.3443066984241,0 -121.769460339216,36.3439527105774,0 -121.769166306665,36.3439019787267,0 -121.768237176868,36.3439281818082,0 -121.767621890743,36.3436833204069,0 -121.767331619522,36.3433941058116,0 -121.767190995958,36.3429633243436,0 -121.767596840008,36.3424666250179,0 -121.767984746791,36.3421724788306,0 -121.767712036611,36.3417045583546,0 -121.767818025661,36.3415267635105,0 -121.767763955477,36.3412161336598,0 -121.767661912312,36.3411435261725,0 -121.767915662278,36.340943403295,0 -121.768252208526,36.3411019091123,0 -121.768489152987,36.3410327962065,0 -121.76844925568,36.3407580902649,0 -121.768802042512,36.3408213550521,0 -121.769333193962,36.3407910490621,0 -121.769630591439,36.340627149587,0 -121.76998975456,36.3402849972416,0 -121.770405806153,36.3400746136599,0 -121.770628194693,36.3399934208096,0 -121.770436161678,36.3395501880381,0 -121.770412308559,36.3391921666734,0 -121.770164359931,36.3388366094569,0 -121.770024073231,36.3387588400147,0 -121.769624545052,36.3386688607262,0 -121.769403226346,36.338494849276,0 -121.769287122395,36.3383791652489,0 -121.769526233598,36.3381717324575,0 -121.76928313672,36.337883008223,0 -121.769192716039,36.3376340189237,0 -121.769328038313,36.3372776366777,0 -121.769708629485,36.3370716604409,0 -121.770273663905,36.3371347206349,0 -121.770610089329,36.3367374730767,0 -121.770971590445,36.3362450754553,0 -121.771700784012,36.3363670612995,0 -121.772342544859,36.3360492723964,0 -121.7727231223,36.3358432862503,0 -121.772984001298,36.3357505582565,0 -121.772988490102,36.3354643833571,0 -121.77337055879,36.335163003394,0 -121.773931097622,36.3355122210961,0 -121.774522096003,36.3354228763051,0 -121.776030329658,36.3354955781142,0 -121.777089051559,36.3356590686462,0 -121.77836178841,36.3357102494367,0 -121.77922621919,36.3362342815027,0 -121.779994480018,36.3353643824204,0 -121.78052186865,36.3348164044313,0 -121.780128148656,36.3343544319127,0 -121.780094376596,36.3334954232741,0 -121.780267167612,36.3330010700693,0 -121.781237789273,36.332762914498,0 -121.781711456831,36.3326341743202,0 -121.782368412669,36.3328507656439,0 -121.783087504552,36.3336213475433,0 -121.783758264243,36.3344677589457,0 -121.78447797736,36.3352001759963,0 -121.784157795079,36.3360746642156,0 -121.783536397107,36.3366026199188,0 -121.784614285691,36.3370524604032,0 -121.783515331293,36.3379571860587,0 -121.783555075661,36.3384346260044,0 -121.783478026837,36.3390282350078,0 -121.783628051619,36.3390349134463,0 -121.784221014883,36.3391449789414,0 -121.785165868744,36.3391544419058,0 -121.785756611585,36.3391692794714,0 -121.786295564592,36.3394944751801,0 -121.786281683581,36.3395850076246,0 -121.786412136815,36.3395904339518,0 -121.7867363824,36.3395937265637,0 -121.786931310912,36.3393810396341,0 -121.78658017921,36.3392105121444,0 -121.786819692025,36.3389744263324,0 -121.787131970281,36.3387987080413,0 -121.787195545659,36.3385012061172,0 -121.786645976742,36.3387699224792,0 -121.7861743518,36.3387651326711,0 -121.785888285368,36.338201709826,0 -121.785938422316,36.3378205908281,0 -121.785812812953,36.3373661308541,0 -121.78641966151,36.3372053329392,0 -121.786892571564,36.3371266535135,0 -121.787878907349,36.337208217826,0 -121.788182309177,36.3376048494141,0 -121.78835399427,36.3379405152963,0 -121.788674724734,36.3381703588717,0 -121.789022902844,36.3385316645482,0 -121.78973310644,36.3383599713196,0 -121.790524361025,36.3386661299203,0 -121.790718908328,36.3384772845955,0 -121.79134970503,36.3386744808032,0 -121.791668236972,36.3390474048945,0 -121.791897972977,36.3394432822223,0 -121.792208400819,36.3393867908122,0 -121.792213004018,36.3390886900086,0 -121.79234767453,36.3389588662733,0 -121.792934448287,36.3391436833538,0 -121.793194955822,36.3394563878133,0 -121.793531916901,36.33959097523,0 -121.793394120027,36.3399235089183,0 -121.79325724182,36.3401964222338,0 -121.793490300113,36.3403776640105,0 -121.793945358713,36.340501516746,0 -121.794302874463,36.34083308671,0 -121.794651311071,36.3411800676898,0 -121.795379122245,36.3413973028066,0 -121.795489099425,36.3419136100287,0 -121.795106786287,36.3422341398337,0 -121.795286334684,36.3428274743751,0 -121.796931537374,36.3432065972789,0 -121.797285277559,36.3432101583442,0 -121.798084743153,36.3433708540546,0 -121.798500145822,36.3439665560526,0 -121.798971218257,36.3440094547685,0 -121.799093820561,36.3437053841571,0 -121.799614693165,36.3435770479436,0 -121.799782700892,36.3433879213027,0 -121.800544079385,36.3429566935673,0 -121.801373565428,36.3426978770333,0 -121.802177125959,36.3425914463169,0 -121.802762600514,36.3428644540797,0 -121.803613326336,36.3427584862662,0 -121.804317887545,36.3429563529658,0 -121.805022452424,36.3431542155701,0 -121.806419328184,36.3432624616339,0 -121.806423062866,36.3432516773214,0 -121.806168283046,36.3424914624847,0 -121.805587719427,36.3419728082014,0 -121.805351217233,36.3399823840648,0 -121.805096458958,36.3392221657638,0 -121.804747917153,36.3385015934115,0 -121.804782642362,36.3379661680818,0 -121.804758306001,36.3369349632293,0 -121.804837670685,36.3362842316732,0 -121.805486950441,36.3357011573828,0 -121.805756579472,36.3350857075738,0 -121.806215571372,36.3344673463175,0 -121.806265190929,36.3344558505466,0 -121.805526482479,36.3329770219975,0 -121.806185112916,36.3323157516541,0 -121.808226447828,36.3308692373751,0 -121.808946889034,36.3300177526999,0 -121.808560980542,36.3292267943889,0 -121.807417523394,36.3288218334215,0 -121.806549700757,36.3277398362604,0 -121.809121442449,36.3272646011075,0 -121.811327531767,36.3275727861567,0 -121.812424611301,36.3281203602408,0 -121.814327777873,36.3279961456458,0 -121.815966766868,36.327797727983,0 -121.81937788834,36.3273663624829,0 -121.820913342781,36.3281686339069,0 -121.823288817011,36.3289791597306,0 -121.820003799885,36.3298412156939,0 -121.820563435629,36.3308485196817,0 -121.821122174397,36.3313530101335,0 -121.821153862924,36.3313330574354,0 -121.821672784403,36.3312485992224,0 -121.821863963348,36.3313220494089,0 -121.822378332965,36.3310466245557,0 -121.822565872119,36.3309673020091,0 -121.822944590632,36.3309614270413,0 -121.823335146796,36.3314520568594,0 -121.823439842896,36.3318707069452,0 -121.823777601204,36.3321329133455,0 -121.824349331712,36.3322768654791,0 -121.82472987909,36.3323473707545,0 -121.825444547138,36.3325273043964,0 -121.826158305224,36.3326690412717,0 -121.826773736362,36.3326594750181,0 -121.827577617238,36.3326087680343,0 -121.827861662616,36.332604349802,0 -121.828000032375,36.3324493696901,0 -121.82871379583,36.3325910910282,0 -121.829382962148,36.3328481222648,0 -121.82990645269,36.3329545919643,0 -121.830766817916,36.3332850520133,0 -121.831290315417,36.333391515495,0 -121.831759153162,36.3331931735065,0 -121.832230734837,36.3331094067276,0 -121.832942681573,36.3331747175969,0 -121.833749311051,36.3332385455034,0 -121.834565103657,36.3336842951873,0 -121.83504859808,36.3340970214054,0 -121.835577606568,36.3344326213801,0 -121.83619213304,36.3343848134984,0 -121.836529028971,36.3346087895303,0 -121.837145391209,36.3346373612925,0 -121.837569633001,36.3345543144168,0 -121.838288942124,36.3349251323615,0 -121.838862557506,36.3351453993775,0 -121.839629219904,36.3355154681661,0 -121.840221439441,36.3356958988368,0 -121.840183712822,36.3356558948949,0 -121.840815819685,36.3352744343378,0 -121.841665015437,36.3351634090236,0 -121.842765065997,36.3355318457928,0 -121.843215139943,36.3349995349129,0 -121.843950271567,36.3351259084548,0 -121.843905056226,36.3356919544804,0 -121.844928353597,36.3362683333034,0 -121.845633253485,36.3359471805653,0 -121.846337708026,36.3356558342283,0 -121.847325495917,36.3361424050725,0 -121.848206271201,36.3363894170119,0 -121.849013361148,36.3366357128005,0 -121.848970191555,36.3367939081931,0 -121.849143367206,36.3367911832099,0 -121.84961687773,36.3368408834272,0 -121.849815403313,36.3372378279879,0 -121.849869986285,36.3375417829675,0 -121.849688964407,36.3378684983852,0 -121.84943297441,36.3380249345931,0 -121.849177443185,36.3382004141503,0 -121.848924674049,36.3384901543688,0 -121.849000558823,36.3386985213784,0 -121.849082432179,36.3391544535026,0 -121.849039823258,36.3393456331963,0 -121.848971303588,36.3394419659291,0 -121.848906467905,36.3396906475793,0 -121.849008264485,36.3399938597445,0 -121.849129985061,36.3401443513929,0 -121.849580830436,36.3402325103729,0 -121.850039980095,36.340309122699,0 -121.850144683526,36.3403423986444,0 -121.850531120569,36.3404652129562,0 -121.850652384676,36.3405966585544,0 -121.850632924621,36.3407684236064,0 -121.850518572884,36.3409226307013,0 -121.85045706592,36.3409394916599,0 -121.850225491488,36.3411244219641,0 -121.850134206971,36.341157132563,0 -121.850101006562,36.341234019088,0 -121.849656603532,36.3414124731498,0 -121.849422944136,36.3414839639381,0 -121.84944683631,36.3416415271462,0 -121.849488348545,36.3416683430489,0 -121.849520945026,36.3416622696159,0 -121.849923661852,36.3417130831169,0 -121.850424958393,36.3419338009951,0 -121.850757775422,36.3420238145355,0 -121.85123085769,36.3420544648231,0 -121.851904335148,36.3425582270729,0 -121.852144107626,36.3427068557587,0 -121.85264772403,36.3430227822276,0 -121.853036071144,36.3434548298111,0 -121.853367513163,36.3434877054596,0 -121.853867907872,36.3436703207873,0 -121.854041017304,36.3439914545857,0 -121.85426503931,36.3444641921204,0 -121.854531663847,36.3447457473767,0 -121.855080673391,36.3449847443473,0 -121.855387589488,36.3449798992945,0 -121.85579402584,36.345183041527,0 -121.856007893534,36.3452368158647,0 -121.856409246487,36.3452304767014,0 -121.856437281262,36.3452839501205,0 -121.856570945681,36.345089839742,0 -121.8567633811,36.3448340802175,0 -121.857212725579,36.3447525116011,0 -121.857551622585,36.3449656493055,0 -121.857927568953,36.3450646509033,0 -121.858132906101,36.3447326862581,0 -121.85839566853,36.3445062183999,0 -121.858994266397,36.3447027513882,0 -121.859839940039,36.3449398023311,0 -121.859624069586,36.3451858024572,0 -121.860019292636,36.3455807454796,0 -121.86002691264,36.3458670414012,0 -121.860342794319,36.3460417885748,0 -121.860528269717,36.3462629952659,0 -121.860511890332,36.3465776845921,0 -121.86046537004,36.3469374051225,0 -121.860844098962,36.3472510915399,0 -121.860456159941,36.3475693934435,0 -121.860009082359,36.3478990557927,0 -121.860403770947,36.3481294141048,0 -121.860029870816,36.3484955522743,0 -121.860650362057,36.3484060628843,0 -121.860779725506,36.348633889661,0 -121.861101585634,36.3488039214705,0 -121.861039844211,36.3489941483543,0 -121.861747046042,36.3490247394521,0 -121.861563734795,36.3494642536402,0 -121.861676104986,36.3498469550352,0 -121.861564064757,36.350454111581,0 -121.861179759798,36.350522005039,0 -121.861126331239,36.3511535716203,0 -121.860813119103,36.3512843661945,0 -121.860972838647,36.3513794957816,0 -121.861192289464,36.3516617838327,0 -121.861371190641,36.3520247260001,0 -121.861350367453,36.3523336794226,0 -121.861312318045,36.3525171701417,0 -121.861228986067,36.3525870725631,0 -121.860977043804,36.3527167974017,0 -121.860710377546,36.3528238934922,0 -121.860565163011,36.3528690061402,0 -121.860392371342,36.3530537267971,0 -121.860459507984,36.3533860539434,0 -121.860377336445,36.3536493028914,0 -121.860056731488,36.3538210721793,0 -121.859737283116,36.3540404482521,0 -121.859623855608,36.3542327507329,0 -121.85977342949,36.3543718717087,0 -121.859974503518,36.3543148908664,0 -121.860149837909,36.3544238972989,0 -121.860352222337,36.3547001248127,0 -121.860498943816,36.3547492280508,0 -121.860765684358,36.3546563641604,0 -121.861196493259,36.3544338781341,0 -121.861477973541,36.3543411531241,0 -121.861829515308,36.3544995399049,0 -121.862227019074,36.3545391038279,0 -121.862610302097,36.3545427531924,0 -121.862812522165,36.3548309009939,0 -121.863384154804,36.3550629335894,0 -121.863261885783,36.3553599191803,0 -121.863141870259,36.3555018886838,0 -121.863286861101,36.3556702315762,0 -121.863782885125,36.3560327283922,0 -121.863839946422,36.3561644565118,0 -121.864013904109,36.3563688518423,0 -121.86420156516,36.3566449329048,0 -121.864480278553,36.3567429898185,0 -121.864179025995,36.3571813864392,0 -121.863466547696,36.357508537469,0 -121.863300741722,36.3577574049897,0 -121.863607902251,36.3579272902878,0 -121.864040454574,36.3575855512865,0 -121.864317785049,36.3577790030403,0 -121.864343977842,36.3580058450624,0 -121.864411799211,36.3584119719924,0 -121.865014159663,36.3585608073254,0 -121.865272252548,36.3590641487894,0 -121.865145655525,36.3596592437049,0 -121.865136825278,36.3602673831028,0 -121.864737212252,36.3603709199554,0 -121.864864008765,36.3607776069072,0 -121.865330239989,36.3611636661282,0 -121.864822052844,36.3616358762114,0 -121.864640632819,36.361944226737,0 -121.863650073757,36.3621256239194,0 -121.863113077755,36.3625498487389,0 -121.862590124969,36.3630219085209,0 -121.862307254316,36.3631000701253,0 -121.8623247479,36.3631418661326,0 -121.862714283426,36.3633738288124,0 -121.862778810552,36.3637196520188,0 -121.862821468652,36.3637420522829,0 -121.863066728351,36.3641140906629,0 -121.863214683378,36.3640797208333,0 -121.863821939138,36.3638946827224,0 -121.864305352943,36.3641139461506,0 -121.864462159663,36.3644851407934,0 -121.864293741891,36.3649128735362,0 -121.863893583807,36.3650521799111,0 -121.863215202789,36.3650576524769,0 -121.863049552852,36.3652945947608,0 -121.863782576077,36.3655877912284,0 -121.863640344935,36.3662423647099,0 -121.86316160182,36.3667148470686,0 -121.862535412482,36.3671859235851,0 -121.861837753004,36.3675012787454,0 -121.861197674229,36.3679125861062,0 -121.861336948561,36.3684744322424,0 -121.861122881043,36.3689971322892,0 -121.860782543398,36.3690773686074,0 -121.860228494116,36.3689057414153,0 -121.860108677952,36.3691541109397,0 -121.859789744811,36.3693972895742,0 -121.859350989073,36.3695709231536,0 -121.858823089904,36.3697221520258,0 -121.858273783554,36.3697678213425,0 -121.858821655101,36.3700604297732,0 -121.860187681081,36.370431249281,0 -121.860372577877,36.3708981242416,0 -121.859894830149,36.3712990467437,0 -121.860050063318,36.3717775649385,0 -121.859810590936,36.3718443685685,0 -121.859823336616,36.3718542503255,0 -121.859947045711,36.3719692860042,0 -121.86012052474,36.3721420299324,0 -121.860434771031,36.3721370575016,0 -121.860628153449,36.372133997125,0 -121.861114457599,36.3722432930337,0 -121.861338183178,36.3724932342095,0 -121.861581336722,36.3725478806642,0 -121.861965254051,36.3724248081668,0 -121.862080894541,36.3722084907577,0 -121.862386594054,36.3718526700248,0 -121.862887571564,36.3715717503947,0 -121.863225512646,36.3715468958246,0 -121.863641674797,36.371754786626,0 -121.863762537954,36.3717528706339,0 -121.863811358218,36.3717715958493,0 -121.86417870266,36.3719607584171,0 -121.864325164199,36.3720169323802,0 -121.864373510711,36.3720161657,0 -121.864881138137,36.3720081145309,0 -121.86519348179,36.3719251650206,0 -121.865480224482,36.3717841238955,0 -121.865913904691,36.3717187451296,0 -121.866228625436,36.3717332488369,0 -121.866259936894,36.3720252324469,0 -121.866120133852,36.3722419388101,0 -121.865882212477,36.3724017058062,0 -121.865836721104,36.3725194195717,0 -121.865937219191,36.3726738152503,0 -121.866084636443,36.3727689691348,0 -121.86652260537,36.3728790089296,0 -121.866861028469,36.3728736355256,0 -121.867028334628,36.3727929841896,0 -121.867604199202,36.3726083488575,0 -121.867845929374,36.3726045085825,0 -121.868331770389,36.3726942824501,0 -121.868371062507,36.3727137781053,0 -121.868520151292,36.3725291262166,0 -121.868714945492,36.3723163044768,0 -121.869646816258,36.3721223852693,0 -121.869945166148,36.371886689476,0 -121.871054140484,36.3716825085547,0 -121.872002120571,36.3713933156193,0 -121.872378947343,36.3718500587855,0 -121.871917548711,36.3721438507258,0 -121.871531766711,36.3723071699676,0 -121.872385775128,36.3723987161163,0 -121.872473895214,36.3724821030926,0 -121.872580475999,36.3723927006768,0 -121.872916507212,36.37228985405,0 -121.873182886365,36.3723051082122,0 -121.873618473344,36.372317666358,0 -121.873913324613,36.3725079552781,0 -121.874156009956,36.3725430841222,0 -121.874420478356,36.3724803712987,0 -121.874659816916,36.3723790607037,0 -121.874777334346,36.3722406955266,0 -121.875059279191,36.3719047189436,0 -121.87532374328,36.3718420040921,0 -121.87583519641,36.3719898356212,0 -121.876104922555,36.3721415221296,0 -121.876568511141,36.3723096124429,0 -121.876713548137,36.3723072972839,0 -121.877167086918,36.3720660707051,0 -121.87767088362,36.3719020354589,0 -121.87813351634,36.3720311364519,0 -121.878597108744,36.3721992198735,0 -121.878908959152,36.3720967418082,0 -121.879097547733,36.3718987396759,0 -121.879237313358,36.371682017851,0 -121.879544847331,36.3714041176765,0 -121.880052469088,36.3713960010062,0 -121.880367670663,36.3714299579008,0 -121.880557213542,36.3712709348695,0 -121.88058095037,36.3712277037072,0 -121.880547796729,36.3708893338279,0 -121.880802729377,36.3705935739535,0 -121.881328931414,36.370920503334,0 -121.881330043577,36.3709236001778,0 -121.881828755996,36.3708606119385,0 -121.882266256712,36.370951103255,0 -121.882824620655,36.3710396556943,0 -121.883408598182,36.3711862918517,0 -121.884087829108,36.3712729024879,0 -121.884546623828,36.3712460507235,0 -121.884938188677,36.3714347620996,0 -121.885235468995,36.3717224771846,0 -121.885268776043,36.3720924224896,0 -121.884908108453,36.3721762004419,0 -121.884444502342,36.3720081429999,0 -121.883934475008,36.3719188230302,0 -121.883428769203,36.3720049205395,0 -121.88326724553,36.3723194912006,0 -121.883007107764,36.3725576440883,0 -121.882621302001,36.3726028196163,0 -121.882134004954,36.3724546306529,0 -121.881693137024,36.3722277017915,0 -121.8813339041,36.3723699429211,0 -121.88087797855,36.3725137293545,0 -121.880739655499,36.372788926635,0 -121.880533608315,36.3732601943908,0 -121.880422333385,36.3736519511426,0 -121.880357006077,36.3739454778075,0 -121.880121026225,36.3741832380735,0 -121.879927159329,36.3741668389614,0 -121.879753632326,36.3739941249446,0 -121.879434587042,36.373804237241,0 -121.879167242346,36.3737500146867,0 -121.87872972928,36.3736595119531,0 -121.878363778285,36.3735288674905,0 -121.878048570322,36.3734949057835,0 -121.877590237942,36.3735412237474,0 -121.877158470055,36.3736846101996,0 -121.876678834987,36.3738482583341,0 -121.876297804285,36.3740883254916,0 -121.87582294755,36.3744468803189,0 -121.875226739823,36.3747878711576,0 -121.874962265463,36.3748505857079,0 -121.874384487806,36.3749572922838,0 -121.873762663324,36.3752401873896,0 -121.873327535348,36.3752471214008,0 -121.87274879865,36.3753148378513,0 -121.871977624124,36.3754246128849,0 -121.871813659434,36.375641710548,0 -121.871825115393,36.3761094984462,0 -121.871396187593,36.376369810767,0 -121.870698477133,36.3765174055859,0 -121.869997902725,36.376548048451,0 -121.869253271972,36.3767548772449,0 -121.868508159336,36.3769422102968,0 -121.867814726297,36.3772652082881,0 -121.867011732899,36.377063475474,0 -121.865987369374,36.3767092614888,0 -121.865035061572,36.3763343970884,0 -121.863838963356,36.3760994566829,0 -121.863828907849,36.3761021666456,0 -121.863828860007,36.3760767074473,0 -121.862844664144,36.3757646622189,0 -121.861747814987,36.3754115601519,0 -121.860945807579,36.3752487695158,0 -121.860002080977,36.3752247051207,0 -121.859320947049,36.375059990602,0 -121.858617538368,36.3749736186252,0 -121.857892326642,36.3749850809873,0 -121.857212620896,36.3748788285969,0 -121.856077876436,36.374955243485,0 -121.855165425436,36.3752231283561,0 -121.854491395587,36.3753507550817,0 -121.85381878235,36.3755368501305,0 -121.853766695652,36.3758833239773,0 -121.854382766472,36.3757799420021,0 -121.85481425839,36.3758954076063,0 -121.854819758925,36.3759159718844,0 -121.854855949427,36.375917093976,0 -121.855265455676,36.3761301014824,0 -121.855610538773,36.3762842438378,0 -121.856257215213,36.376483703849,0 -121.856881970609,36.3768687722251,0 -121.857194132453,36.3770823688974,0 -121.857782876651,36.3773281259451,0 -121.858271793288,36.3776327241653,0 -121.858468661112,36.3777756272386,0 -121.858411780811,36.3780593539337,0 -121.858274094713,36.3787694798644,0 -121.858594005053,36.379180864278,0 -121.858979211045,36.3799010743925,0 -121.859133745376,36.3802886028286,0 -121.859141805537,36.3806199531936,0 -121.859001493173,36.3808171586632,0 -121.858864499178,36.3811508017108,0 -121.858630326246,36.3814664827378,0 -121.858373397496,36.3818410184383,0 -121.857945450614,36.3823381199955,0 -121.857790916622,36.3824668918328,0 -121.85842662783,36.3823590236203,0 -121.858832482583,36.3820385175577,0 -121.859799317384,36.3820859138248,0 -121.85979207484,36.3825819620017,0 -121.859809541613,36.3830019202858,0 -121.860018277924,36.3832519713508,0 -121.860845226682,36.3831835354531,0 -121.860840217029,36.3835269534881,0 -121.859772574801,36.3839174761129,0 -121.858919668575,36.3841983085015,0 -121.858973847054,36.384220734487,0 -121.858777584833,36.3846524734033,0 -121.858672215151,36.3851780291077,0 -121.858673951936,36.3852494410011,0 -121.858792637861,36.3852713778164,0 -121.859065326209,36.3855528253499,0 -121.85898658947,36.3859588932406,0 -121.858845902632,36.3862468762642,0 -121.858525157474,36.3864186377534,0 -121.858498017847,36.3865966481494,0 -121.858746241835,36.3866918469283,0 -121.859268701218,36.3867978901405,0 -121.859703162493,36.3871720308887,0 -121.859903152308,36.3876616269126,0 -121.860111263518,36.3877959494099,0 -121.860647398867,36.3879779722409,0 -121.861118682572,36.3879228877416,0 -121.861829668408,36.3880068844002,0 -121.862422542538,36.3880927491646,0 -121.862868940957,36.3882285568057,0 -121.863199550069,36.3884614502592,0 -121.863446801393,36.3889099822304,0 -121.863484455593,36.3892427707358,0 -121.863580005863,36.3895270136603,0 -121.863734615152,36.3898103204723,0 -121.863886901872,36.3899984116999,0 -121.864179717907,36.3902226298143,0 -121.864564108411,36.390075286327,0 -121.865093657204,36.3898578382759,0 -121.865181938906,36.3894906005784,0 -121.865554511347,36.3888183438881,0 -121.866068945561,36.3888876831849,0 -121.866454626786,36.3887771992369,0 -121.867195153508,36.3888606953088,0 -121.867490018867,36.3888887233313,0 -121.868053793628,36.3889423110111,0 -121.868378603167,36.388937150669,0 -121.869115312189,36.3889042097479,0 -121.869323463162,36.3888405229555,0 -121.870015422292,36.3893534113677,0 -121.870374421502,36.3895382064955,0 -121.870640758105,36.3895577834677,0 -121.870882812433,36.3897920654227,0 -121.871150316422,36.389859248572,0 -121.87153826664,36.3900197665698,0 -121.871900188109,36.3903235769544,0 -121.872082024312,36.3905111880315,0 -121.872107314372,36.3906871662029,0 -121.872118932126,36.3906968104235,0 -121.872151421646,36.3907934247539,0 -121.872139190845,36.3909089613535,0 -121.872067927422,36.3910740051621,0 -121.871980435427,36.3911844609799,0 -121.871971325412,36.3912369368864,0 -121.871704042548,36.3915322096997,0 -121.871456467084,36.3917911315807,0 -121.871262716426,36.3922077963195,0 -121.871388972346,36.3924692064712,0 -121.871377200605,36.3925808952098,0 -121.871658693486,36.3928582437588,0 -121.871821985761,36.3933438141333,0 -121.871744927867,36.3939064361639,0 -121.871843501925,36.3942221771999,0 -121.871851866752,36.3942960267086,0 -121.872062402753,36.3944498496756,0 -121.872184482826,36.3949957742981,0 -121.872101468984,36.3954256834039,0 -121.872062305785,36.3958538000611,0 -121.872197339704,36.3959524573583,0 -121.871826904722,36.3960476809805,0 -121.871459743447,36.396221958049,0 -121.871200378426,36.3964880306035,0 -121.871001821656,36.3968245720894,0 -121.870864074164,36.3972315866163,0 -121.870638313217,36.3976638126229,0 -121.870258483593,36.3978365452302,0 -121.869608208011,36.3978230717443,0 -121.869075761766,36.3978185323406,0 -121.868752679117,36.3981945117148,0 -121.86848922196,36.3982939496381,0 -121.868376916263,36.3985338644561,0 -121.868147064228,36.398799460298,0 -121.868004060503,36.3989922371815,0 -121.867775368135,36.3993054383398,0 -121.867575626029,36.3995943664429,0 -121.867405995502,36.3999066294063,0 -121.867397711529,36.4000930463012,0 -121.867722551158,36.4004486570152,0 -121.867847082312,36.4007086224833,0 -121.867800236688,36.4012094404338,0 -121.86765780941,36.401426019707,0 -121.867623814024,36.4015927498356,0 -121.867751995068,36.4016747273811,0 -121.867765342771,36.4016709793889,0 -121.867818515736,36.401642141765,0 -121.868664208923,36.4015447840254,0 -121.868905439045,36.4016691712641,0 -121.868972830255,36.4017249101998,0 -121.868767808501,36.4018694979512,0 -121.8688564888,36.4019394877262,0 -121.869084729065,36.4019187838303,0 -121.869143485221,36.4020295086178,0 -121.869364599697,36.4021053656422,0 -121.869779336527,36.4018584343945,0 -121.870021908773,36.4017482965716,0 -121.870245287268,36.4017169492235,0 -121.870285183963,36.4019008466581,0 -121.870336313646,36.4020230555502,0 -121.870399680942,36.4019751105162,0 -121.870481320975,36.4016921371403,0 -121.870615683215,36.4017025309118,0 -121.870599837523,36.4019318971725,0 -121.87065080284,36.4020649643661,0 -121.870827745398,36.4021576681604,0 -121.870938805188,36.4022713279358,0 -121.871035699536,36.4021787909297,0 -121.871251365744,36.4020695746476,0 -121.871600053366,36.4019950593844,0 -121.871744052959,36.4021065385644,0 -121.87184622936,36.4021292537102,0 -121.871973299985,36.4018968233212,0 -121.872034152285,36.4017566786385,0 -121.872113193553,36.4015622179639,0 -121.87222400128,36.4014322145407,0 -121.87232693123,36.4013372478681,0 -121.87247378278,36.4013093359843,0 -121.872645696004,36.4012126922842,0 -121.87276362933,36.4012875429821,0 -121.872852392916,36.401350323494,0 -121.873069819338,36.4015606254952,0 -121.873131342758,36.401660957178,0 -121.873269392307,36.4018679058579,0 -121.873373830681,36.4018396592795,0 -121.873506683902,36.4017308624219,0 -121.873642889694,36.401641427454,0 -121.873786388707,36.401633045429,0 -121.873897113236,36.4017244084034,0 -121.873998953839,36.4017730229216,0 -121.874066846739,36.4017900387379,0 -121.874252002884,36.4020528944977,0 -121.874394747569,36.4023059441412,0 -121.874461298964,36.4024738337842,0 -121.874647628617,36.4027334220098,0 -121.87475022062,36.4027534484069,0 -121.875035303039,36.4027307277082,0 -121.875343226346,36.4027197603024,0 -121.875891580554,36.4027883164784,0 -121.876536013869,36.4030457734026,0 -121.877476847138,36.4026605689326,0 -121.878276216657,36.4025845044701,0 -121.878664061153,36.4027853047072,0 -121.879468846558,36.4027956835855,0 -121.880008982785,36.4028602336383,0 -121.880821897125,36.4030002786376,0 -121.881113648168,36.403378352638,0 -121.881106940309,36.4036406484737,0 -121.88151686759,36.4038280556023,0 -121.882524534219,36.4039548096557,0 -121.882940352884,36.4040434064984,0 -121.883389228034,36.4042743502281,0 -121.883458856842,36.4047018698673,0 -121.883384337507,36.4052745786098,0 -121.883514211864,36.4057487590121,0 -121.88384789434,36.4061006108993,0 -121.884565530965,36.406446311082,0 -121.885224692305,36.406816756487,0 -121.885993186847,36.4068282504159,0 -121.886885112166,36.4070520754287,0 -121.88736355097,36.4072825298942,0 -121.887908122155,36.4077976783663,0 -121.88815734596,36.4083175658129,0 -121.88835691548,36.409219257847,0 -121.888399983529,36.4097662668619,0 -121.888442464462,36.410289471251,0 -121.888510843829,36.4108665887813,0 -121.888954971026,36.4110714561991,0 -121.890221130309,36.4111492740318,0 -121.891073866466,36.4117718999274,0 -121.891291937187,36.4119608602131,0 -121.891975479859,36.4121615557412,0 -121.89248763172,36.4125581375982,0 -121.892638265399,36.412674779178,0 -121.893179960441,36.4130708843439,0 -121.893383306389,36.4131672710414,0 -121.893653169043,36.4131832856374,0 -121.894089675326,36.4133159073625,0 -121.895163630504,36.4135313581657,0 -121.895523923539,36.414084151227,0 -121.895475419294,36.4144573298061,0 -121.895660764768,36.41494311618,0 -121.896012983876,36.4151701891925,0 -121.896160084214,36.4154177187993,0 -121.896372356736,36.4154960176617,0 -121.897765379965,36.4156640565939,0 -121.898600731986,36.4159839596792,0 -121.898873676557,36.4162653105163,0 -121.898916824556,36.4168123139777,0 -121.898873131215,36.4174321580465,0 -121.898648653018,36.4179120420691,0 -121.898301873385,36.4182272074616,0 -121.897923186897,36.4184476343064,0 -121.897511232272,36.418707147711,0 -121.89746466962,36.4189638603752,0 -121.897179416484,36.4191081103437,0 -121.896545965838,36.4191881492606,0 -121.89605456423,36.4191727954764,0 -121.895592034993,36.419156974959,0 -121.895187250229,36.4191402212711,0 -121.894871886824,36.419145301392,0 -121.894590770528,36.4193171286968,0 -121.894472345885,36.4196236994345,0 -121.893766642173,36.4199611249588,0 -121.893641190533,36.4203563372194,0 -121.893059239273,36.4207228981106,0 -121.892672787941,36.4213780803145,0 -121.892918017605,36.4218174219185,0 -121.89309318721,36.4220910777684,0 -121.89321152133,36.4223149117315,0 -121.893178214038,36.4223601029539,0 -121.893149820826,36.4223845626441,0 -121.89367308185,36.4225262778428,0 -121.896063058181,36.4230878706108,0 -121.896122894169,36.4231393344329,0 -121.896818565028,36.4231870243072,0 -121.897337710489,36.4231553785328,0 -121.898173885391,36.4230953413362,0 -121.898635860721,36.4230878866152,0 -121.899302843088,36.4231934936549,0 -121.899652796609,36.4233274925346,0 -121.899920760961,36.4236490124063,0 -121.899945362989,36.4237134756689,0 -121.900819425024,36.4239272649413,0 -121.901585722951,36.4238434426218,0 -121.902242746397,36.4241185760969,0 -121.902485006438,36.4243527888978,0 -121.902960153231,36.4256310052451,0 -121.903958773692,36.426567366492,0 -121.904269516837,36.4269616768322,0 -121.904991410803,36.4273544715172,0 -121.906603439898,36.4276693085473,0 -121.907841585362,36.4276659507211,0 -121.908762827921,36.4282474913143,0 -121.908993276207,36.4290957689493,0 -121.909462001821,36.4299818773228,0 -121.909595830987,36.4311677156765,0 -121.909841304195,36.4322536421715,0 -121.910821437668,36.4328327368824,0 -121.911851399034,36.4332668039697,0 -121.912437830269,36.4341480450586,0 -121.911780013163,36.4349376430466,0 -121.911036800388,36.4354420818927,0 -121.910577774574,36.4355114159302,0 -121.910440327855,36.4361365869503,0 -121.909338897142,36.4373733498852,0 -121.909077078209,36.4381354367905,0 -121.90929280535,36.4385275325904,0 -121.909417182291,36.4387731676048,0 -121.909665464466,36.4392453959656,0 -121.909725596718,36.4397587774036,0 -121.90973321599,36.4400634578756,0 -121.909764950032,36.4403867985694,0 -121.90958965336,36.4409421009593,0 -121.909220010072,36.4412910027539,0 -121.908965699525,36.4415237320212,0 -121.9088040377,36.4416787569198,0 -121.908570032022,36.441777803401,0 -121.90828236897,36.442056666899,0 -121.9085413558,36.4428817834516,0 -121.908837833252,36.443030776727,0 -121.909264763267,36.443081001157,0 -121.909572070079,36.4430760148346,0 -121.909922367634,36.4428988781432,0 -121.910361027337,36.4424726514608,0 -121.910691017146,36.4424291940032,0 -121.911260730809,36.4425151932169,0 -121.911736367284,36.442621768595,0 -121.912214389983,36.4428235547893,0 -121.912908979297,36.4431742213605,0 -121.913100356757,36.4433346140335,0 -121.914091381687,36.4435153348123,0 -121.914883189647,36.4439115437354,0 -121.915584397006,36.4447403736984,0 -121.915347359817,36.44565558415,0 -121.915531144452,36.4466963874114,0 -121.916971434388,36.448018889647,0 -121.918072497896,36.4486405763316,0 -121.91921135051,36.4489271119714,0 -121.919402846066,36.4489700380794,0 -121.920784446263,36.4491659815965,0 -121.92101129205,36.4492899288955,0 -121.922261654988,36.4495743497226,0 -121.922690394143,36.450070272254,0 -121.922796083396,36.4505105116727,0 -121.922835329759,36.4513176005027,0 -121.922578214812,36.4516266044427,0 -121.922324169526,36.4520574807119,0 -121.921919579152,36.4525212928335,0 -121.921227064423,36.4528221629722,0 -121.920568538733,36.4529700732575,0 -121.919435637578,36.4530647552276,0 -121.918395005907,36.4530664822812,0 -121.917467855406,36.4530663502441,0 -121.917241486091,36.45304760653,0 -121.916659320488,36.4532055926624,0 -121.915961857398,36.4533349875408,0 -121.915236890214,36.4530295873974,0 -121.91446206845,36.4525921103555,0 -121.91374980221,36.4524873735091,0 -121.912801821959,36.4525935563895,0 -121.912787908997,36.4530300573535,0 -121.91264767783,36.4534382375256,0 -121.912533562849,36.4536720249326,0 -121.912280182179,36.4541911227559,0 -121.912420074717,36.4550907378617,0 -121.911861589391,36.4554491073024,0 -121.911035662217,36.4555167078053,0 -121.910553631449,36.4557713181259,0 -121.910330580467,36.4561829117238,0 -121.909991771515,36.4567334099677,0 -121.909772944904,36.4572118946133,0 -121.909501803828,36.4574544879195,0 -121.909563600706,36.4577279257383,0 -121.909754309369,36.4579762928025,0 -121.909987575735,36.4582239695083,0 -121.910149912096,36.4584727963253,0 -121.910460117629,36.458959254952,0 -121.910269512804,36.4592823910611,0 -121.910003973415,36.4594467207528,0 -121.909426330678,36.4596161143671,0 -121.908781751809,36.4599466114813,0 -121.908657789214,36.4602832708804,0 -121.909015950949,36.4609987927859,0 -121.909757885006,36.4615717923496,0 -121.910668804606,36.4615342253443,0 -121.911024538192,36.4612512895684,0 -121.911775288663,36.4606502617357,0 -121.912229851416,36.4599608512694,0 -121.913163941804,36.459194776129,0 -121.91317702364,36.4591840478767,0 -121.914083677666,36.4590795645242,0 -121.914595334492,36.4592931766513,0 -121.914683285747,36.4600272674318,0 -121.914636444065,36.4605992597305,0 -121.914347229362,36.4609811635972,0 -121.914138381393,36.4612569420309,0 -121.914523721621,36.461442233465,0 -121.914525541067,36.4614420291879,0 -121.915471804358,36.4613360289576,0 -121.915623530664,36.4617656913913,0 -121.915483305499,36.4621738760597,0 -121.914846211564,36.4626025700245,0 -121.915200735331,36.4629567953897,0 -121.915369149516,36.4629035902614,0 -121.915209199715,36.4630905765832,0 -121.915908867206,36.4629946250224,0 -121.916593714432,36.4626645497792,0 -121.917792356242,36.4625815128184,0 -121.918763741433,36.4628431801069,0 -121.918843268734,36.4634434846206,0 -121.91813396045,36.4640428448533,0 -121.917453344804,36.4644398184671,0 -121.916789656861,36.4651043522155,0 -121.9175168658,36.4654431782886,0 -121.918556275578,36.4654673073249,0 -121.919632855383,36.4654228253001,0 -121.92017114414,36.4654005808812,0 -121.920753928291,36.4660806818771,0 -121.920622201609,36.4666226502403,0 -121.920148616522,36.4670110840077,0 -121.919722791045,36.4674981392633,0 -121.919181209503,36.4681241073938,0 -121.919982796737,36.4683257128404,0 -121.920538057174,36.4685710261654,0 -121.920406326736,36.4691129947819,0 -121.920204489239,36.4698590564484,0 -121.920731066432,36.4703067505016,0 -121.92148279374,36.4703762740859,0 -121.922234521734,36.4704457928795,0 -121.922464888543,36.4708051288962,0 -121.922442559036,36.471107845615,0 -121.923123017404,36.4714145364179,0 -121.923649800743,36.4711585202944,0 -121.924085103787,36.4714758427027,0 -121.924168929569,36.4721430288616,0 -121.924242152651,36.4726429907828,0 -121.92402338061,36.4731214963182,0 -121.924044589567,36.4734559458838,0 -121.924504351175,36.473503993214,0 -121.924569092323,36.4738701742439,0 -121.92448091981,36.4744438776564,0 -121.924949170347,36.4746257020061,0 -121.925388501063,36.4751347438543,0 -121.925316528288,36.4751805584055,0 -121.924969278654,36.4755973174718,0 -121.925040391708,36.4760638319603,0 -121.925020193549,36.4763999946361,0 -121.924500924362,36.4767232699392,0 -121.924400021176,36.477096303351,0 -121.924843849498,36.477547400691,0 -121.924878461318,36.4775726285007,0 -121.925401734962,36.4777025623317,0 -121.926096968077,36.4777874075432,0 -121.926884362966,36.4777360358431,0 -121.927552306958,36.4776866151614,0 -121.92794280487,36.4780073611506,0 -121.928037998948,36.4783913029148,0 -121.928044443756,36.4783901589611,0 -121.928395365294,36.4786437527148,0 -121.928701106162,36.4789613390871,0 -121.929016496591,36.4792217674846,0 -121.929169565306,36.4796882472013,0 -121.928717046772,36.4797342735493,0 -121.928089212222,36.4796427693293,0 -121.928342094698,36.4799384152988,0 -121.928384125677,36.4801033687011,0 -121.928474486085,36.4806193743351,0 -121.928274551598,36.4809825078206,0 -121.927654186753,36.4809912449704,0 -121.92737245677,36.4808599141362,0 -121.927412135487,36.480552585492,0 -121.927110025111,36.480614268606,0 -121.926921805142,36.4807699964122,0 -121.926677762688,36.4811184195197,0 -121.926473302101,36.4811666684206,0 -121.926208897709,36.4810641126196,0 -121.92598091966,36.4808903294104,0 -121.925663063478,36.4808087576732,0 -121.925428302738,36.480484647438,0 -121.925440620184,36.4802343168487,0 -121.925525195927,36.4798844603443,0 -121.925396059281,36.4796113894323,0 -121.925386097083,36.479538680014,0 -121.924946376124,36.4794531569749,0 -121.924524924818,36.479347649713,0 -121.924297063567,36.4793684002168,0 -121.92417395858,36.479495582612,0 -121.923859721309,36.4797007434779,0 -121.923409338292,36.4801367270259,0 -121.922707742184,36.4804625115116,0 -121.921612290876,36.4804464217184,0 -121.921372550633,36.480442898261,0 -121.921071840667,36.4803904116848,0 -121.920374169522,36.480209358324,0 -121.919963189914,36.4800236260368,0 -121.919358185191,36.4797255949914,0 -121.919166576957,36.4797094737812,0 -121.918829822183,36.4796837373573,0 -121.918437008911,36.4795750505973,0 -121.917997662111,36.4794534866172,0 -121.917246942248,36.4792371144071,0 -121.916562871713,36.4788482025114,0 -121.915810725914,36.4785746937329,0 -121.915524776382,36.478493622572,0 -121.91494302935,36.4777985924083,0 -121.914353546597,36.4777797387501,0 -121.913636810534,36.4776081289297,0 -121.912761685749,36.4782143054396,0 -121.912028928071,36.4784457404486,0 -121.911213850747,36.4788180017068,0 -121.911091284655,36.4790617231247,0 -121.910951217389,36.4793735594125,0 -121.91078635486,36.4798762956402,0 -121.910947877781,36.4804213605622,0 -121.911392516651,36.4804617673611,0 -121.911832386864,36.4803117510821,0 -121.912213129788,36.4801626934522,0 -121.912631785251,36.4803463925551,0 -121.913019685246,36.48048296492,0 -121.913499855981,36.4807609114327,0 -121.913360394173,36.4810965523029,0 -121.913009212722,36.4812451337827,0 -121.912595323865,36.4812518579258,0 -121.911946119082,36.481310026557,0 -121.911565966756,36.4814828863168,0 -121.911214780704,36.4816314618608,0 -121.910987672994,36.4816835438473,0 -121.91064257447,36.481642499574,0 -121.910327654412,36.4815005556007,0 -121.91019228644,36.4815701257624,0 -121.910148785368,36.481670960407,0 -121.910272487097,36.4817829997518,0 -121.910368223277,36.4819511667556,0 -121.910475930726,36.482140095191,0 -121.910559162999,36.4823746203958,0 -121.910517840256,36.4825140964088,0 -121.910336959087,36.4826786327727,0 -121.910163285181,36.4828058694356,0 -121.909981649684,36.4829101401986,0 -121.909897076238,36.4829334423477,0 -121.909801773288,36.4829872542989,0 -121.909574289594,36.4830316777263,0 -121.909320485498,36.4830736722007,0 -121.909055030856,36.4831115577485,0 -121.908925613587,36.4831750088359,0 -121.908671893308,36.483217085681,0 -121.908591091752,36.4831874977424,0 -121.908481539867,36.4832591637349,0 -121.90850819427,36.483369553401,0 -121.908521019252,36.4834990531557,0 -121.908391686973,36.483734165301,0 -121.908270149174,36.4837941794012,0 -121.908186463051,36.4838114965245,0 -121.908158752959,36.4838172299944,0 -121.908222958529,36.4838924994455,0 -121.908259870665,36.4839293660008,0 -121.908360337706,36.4840297115772,0 -121.908496544167,36.4840522592117,0 -121.908757304826,36.4840028891523,0 -121.90887565802,36.4839872985854,0 -121.909058299205,36.4840762303288,0 -121.909107417465,36.4841955889892,0 -121.909074308935,36.4843322982867,0 -121.909054276179,36.4844906323934,0 -121.90913256274,36.4845495573049,0 -121.909228033415,36.4845739483736,0 -121.909213117489,36.4846690367899,0 -121.909245823462,36.484681546595,0 -121.909264913093,36.4847969904452,0 -121.909163491455,36.4849094758795,0 -121.909080594648,36.4850740131097,0 -121.909043463636,36.4851326862815,0 -121.908916812213,36.4852754301842,0 -121.90882201323,36.4854342671278,0 -121.90885545702,36.4856069341966,0 -121.90894573058,36.4857190003939,0 -121.909056455514,36.4858170685891,0 -121.909231553412,36.4858231031169,0 -121.909396088788,36.4858087704219,0 -121.909483932534,36.4856797729751,0 -121.909580323783,36.4856291462427,0 -121.909756092749,36.4856171598854,0 -121.909782579126,36.4858381906307,0 -121.909863967106,36.4860390208626,0 -121.90975106296,36.4861448007557,0 -121.9096234073,36.4862849463634,0 -121.909803869281,36.4863747159553,0 -121.909857513276,36.4865359842294,0 -121.909978715952,36.4866203899485,0 -121.910260432252,36.4866856017805,0 -121.910408792086,36.4866326283617,0 -121.910618338498,36.4865868620595,0 -121.910741887923,36.4865006959369,0 -121.910913046094,36.4866405901891,0 -121.910869125736,36.4867517345656,0 -121.911119576674,36.4869369744689,0 -121.911287047073,36.4870228888645,0 -121.911388887493,36.4871116542271,0 -121.911403975137,36.4872445066329,0 -121.911423588081,36.4873950453918,0 -121.911512437138,36.4875316710942,0 -121.911367764848,36.4876206862714,0 -121.911293920693,36.4876548013826,0 -121.911269529621,36.4877923479626,0 -121.911395425669,36.4879065932539,0 -121.911573707965,36.4878120446724,0 -121.911539091134,36.4877300702653,0 -121.911727348918,36.487561593969,0 -121.911964890952,36.4877530368694,0 -121.912043430504,36.4878750766913,0 -121.912220847258,36.4877717790864,0 -121.912263957934,36.4877552164697,0 -121.912355572373,36.4877645192872,0 -121.912425895842,36.4877716448432,0 -121.912515331748,36.4878418846475,0 -121.912495382724,36.4878791004918,0 -121.912521869215,36.4880065886853,0 -121.912555229609,36.488166181842,0 -121.912632510501,36.4883141214715,0 -121.912672072447,36.4883911505239,0 -121.912510553921,36.4884629835639,0 -121.912370408049,36.4886866133908,0 -121.91225473754,36.4887134351044,0 -121.912251739106,36.4887138589791,0 -121.912122052857,36.4887322109138,0 -121.912017194869,36.4888030374405,0 -121.91190286571,36.4888874433908,0 -121.911717037884,36.4888502277969,0 -121.911537163393,36.4887887889273,0 -121.911274390109,36.4886529183356,0 -121.911121337271,36.4886135229776,0 -121.911015557346,36.488614863497,0 -121.910860994669,36.4885343982664,0 -121.910820090927,36.4885015408277,0 -121.910678018272,36.4884727074149,0 -121.910596965806,36.4885916462477,0 -121.910555809939,36.4887438609938,0 -121.910519516773,36.4888836713518,0 -121.910478529391,36.4890184525457,0 -121.910267389033,36.4890741917918,0 -121.910087176504,36.4891010147051,0 -121.910093883245,36.4891596872305,0 -121.910038801493,36.4893697696764,0 -121.910225897693,36.4895721613446,0 -121.910123471444,36.4896699782977,0 -121.909822141522,36.4897731592748,0 -121.909839156414,36.4898751667996,0 -121.909712758758,36.4899593213188,0 -121.909751063844,36.4901055014236,0 -121.909575127546,36.490232151956,0 -121.909430036328,36.4902319840006,0 -121.909409616479,36.4902275586307,0 -121.909186458472,36.4901791780978,0 -121.909022005861,36.4902327391611,0 -121.908678598201,36.4901718865913,0 -121.908377353419,36.4902405343359,0 -121.908189263671,36.4903710403263,0 -121.907936801086,36.4905530949248,0 -121.907743346784,36.4908459596734,0 -121.907647121614,36.4909509006154,0 -121.907567325977,36.4911002661773,0 -121.907445873043,36.4911120003584,0 -121.907280413478,36.4911152693147,0 -121.907160720429,36.4910517344518,0 -121.906983778369,36.4910596136663,0 -121.90689744483,36.4911215562976,0 -121.906822845298,36.4911687455154,0 -121.906612962097,36.4912824885273,0 -121.9065102834,36.4913109870417,0 -121.906347088888,36.4914061210273,0 -121.90633409625,36.4915502903839,0 -121.90605799583,36.4916318457573,0 -121.905864374585,36.4915734239091,0 -121.905671758382,36.4915354539019,0 -121.905505881484,36.4915508767592,0 -121.905403956226,36.4916822210975,0 -121.90539420705,36.4917666502636,0 -121.905339584145,36.4919830479322,0 -121.905224249828,36.492155966092,0 -121.905167838971,36.4923422123385,0 -121.905087220356,36.4924177806819,0 -121.905060802184,36.4924425441856,0 -121.905016546604,36.4924139835401,0 -121.904959883824,36.4923774163432,0 -121.904935659427,36.4922951897145,0 -121.90483306544,36.4923122888056,0 -121.904581190244,36.4922350918558,0 -121.904349763981,36.4921943553957,0 -121.904147677269,36.4921923450537,0 -121.904034438002,36.4922188313688,0 -121.903874678462,36.4923324059477,0 -121.903640489057,36.4923705426635,0 -121.903487182658,36.4923785063265,0 -121.903312085538,36.4923109474027,0 -121.903095245284,36.4922638413256,0 -121.90294931657,36.4922317392074,0 -121.902844710288,36.4923412905461,0 -121.902857199315,36.4925633270515,0 -121.902759550621,36.4926945042642,0 -121.902880334142,36.4928323854954,0 -121.902953675084,36.4930941534742,0 -121.90302641863,36.4933303859228,0 -121.902804958013,36.4933614883742,0 -121.902608929847,36.4935571938842,0 -121.902486337827,36.4939554110453,0 -121.902406149473,36.4945358208352,0 -121.902129505625,36.4948298467832,0 -121.901741589231,36.4949689768231,0 -121.901619861315,36.4950524859398,0 -121.901639698626,36.4951739491794,0 -121.901748495024,36.4953325494334,0 -121.901847683278,36.4954391577059,0 -121.901991432515,36.4955118288904,0 -121.902016578772,36.4956853346802,0 -121.901922533346,36.4958374654772,0 -121.901820944786,36.4959820540387,0 -121.901671244448,36.4961346044038,0 -121.901504527067,36.4963085288533,0 -121.901268158336,36.4964558836059,0 -121.901030699426,36.4965820301533,0 -121.900798184912,36.4965138859561,0 -121.900575897111,36.4964357666929,0 -121.900160992514,36.4964309052208,0 -121.89995387627,36.4964470815783,0 -121.899760086498,36.4965443952541,0 -121.899709627842,36.4965825336969,0 -121.899638967394,36.4966537796566,0 -121.899533378133,36.4966572489045,0 -121.899485914126,36.4966588093472,0 -121.899387761984,36.496612288942,0 -121.899214340337,36.496553448513,0 -121.898887446821,36.4963941086175,0 -121.898785689604,36.4963771772462,0 -121.898752749183,36.4964188351291,0 -121.89882684512,36.4965785104761,0 -121.898846960811,36.4966840379498,0 -121.898778482058,36.4968821863309,0 -121.8986947468,36.497057032313,0 -121.898699691774,36.4973734494541,0 -121.898721400214,36.4974997645416,0 -121.898717377459,36.4977140905396,0 -121.898576058236,36.497878040903,0 -121.898444043604,36.4980538088656,0 -121.898351507963,36.4983488521117,0 -121.898218402323,36.4984946967489,0 -121.898160903187,36.4986340882524,0 -121.898101558694,36.4988298053219,0 -121.898069026813,36.4989238834456,0 -121.897960323945,36.4990922427755,0 -121.897863847336,36.4992325555792,0 -121.897738874285,36.4993720316765,0 -121.897669974926,36.4995446985391,0 -121.89777969337,36.4996356416398,0 -121.897780113235,36.4997140128976,0 -121.897639464645,36.4998319471049,0 -121.897313073567,36.4999919558613,0 -121.897290860996,36.5002223743135,0 -121.897372669643,36.5004918535696,0 -121.897392115479,36.5007255410157,0 -121.897440980584,36.5008453174574,0 -121.897435616822,36.5010063340202,0 -121.897181477002,36.5010521839189,0 -121.897106710376,36.5010087653172,0 -121.896945107516,36.5011421212056,0 -121.897105286507,36.5012062423922,0 -121.897226992112,36.5013558594304,0 -121.897256915013,36.5014369122125,0 -121.897175778107,36.50150556055,0 -121.897096904867,36.501554260513,0 -121.896944689268,36.5015546782789,0 -121.896884925862,36.5015022080853,0 -121.896761041546,36.5015398435491,0 -121.896729777085,36.5015732022586,0 -

**** [[https://github.com/stchris/untangle][untangle]]
but, [[https://github.com/stchris/untangle][untangle]] seems also nice.  so...
#+BEGIN_EXAMPLE
sudo pip install untangle
#+END_EXAMPLE
to install it

#+BEGIN_SRC python :var input="/Users/minshall/work/gis/play/IR/20160729_Soberanes_IR/doc.kml" :results output verbatim
import os.path
import untangle

kml = untangle.parse(os.path.expanduser(input))

for i in kml.kml.Document:
  print i

#+END_SRC

#+RESULTS:

i'm not sure, though, how to get the raw contents of a subtree.
